{"architecture": {"module": "keras", "class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 24, 1], "dtype": "float32", "sparse": false, "name": "input_layer"}, "registered_name": null}, {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 1]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}, "registered_name": null}, {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 128]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 6, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}}], "build_input_shape": [null, 24, 1]}, "registered_name": null, "build_config": {"input_shape": [null, 24, 1]}, "compile_config": {"loss": "sparse_categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false}}, "weights": [[[0.4990452527999878, -0.292633980512619, -0.2293412834405899, 0.06834518164396286, -0.2548474967479706, 0.14545375108718872, -1.0065830945968628, -0.5324016809463501, -0.4367401897907257, -1.0681471824645996, -0.3962107002735138, 0.5460675954818726, -0.18641282618045807, -0.7628777623176575, 1.0837901830673218, -0.46487361192703247, -0.33048033714294434, -0.31812095642089844, -0.7842175960540771, -0.6060705184936523, 0.18252304196357727, 0.6001469492912292, -0.7936350703239441, -0.8316977024078369, -0.49564293026924133, -0.5282551646232605, -0.21090690791606903, 0.22051945328712463, -0.5331965088844299, -0.5508573055267334, 0.21564161777496338, 0.23884865641593933, -0.5373137593269348, 0.04978053271770477, -0.2919867932796478, -0.9883874654769897, -0.029202766716480255, -0.918856143951416, -0.2648184895515442, 0.4499339759349823, -0.844537079334259, 0.5012835264205933, 0.8563167452812195, -0.18796905875205994, 0.6762028932571411, -0.14207512140274048, -0.6095941662788391, -1.0159120559692383, 0.7620189785957336, -0.4370742738246918, -0.7990228533744812, -0.1154089942574501, -0.8107606172561646, -0.19578580558300018, 1.0782514810562134, 0.6541901230812073, -0.8581571578979492, 0.0784851610660553, -0.9560753107070923, -0.07762335985898972, -0.4296475946903229, -0.7217497825622559, -0.713889479637146, -0.34207582473754883, 0.6424920558929443, 0.4269045889377594, -0.45148125290870667, -0.10407596826553345, -0.40479567646980286, -0.05265562981367111, 0.29240524768829346, -0.38782641291618347, -0.1346677541732788, -0.36696985363960266, -0.3535791337490082, -0.26901233196258545, -0.3058624267578125, -0.6441171169281006, -0.06777432560920715, 0.20783865451812744, 0.2355249524116516, 1.3534003496170044, -1.0368471145629883, -0.45902177691459656, 0.017922544851899147, -0.23475250601768494, 0.8426737785339355, -0.09401198476552963, 0.04152774438261986, -0.3585067093372345, -0.46188482642173767, 0.2223593294620514, -0.3126397132873535, -0.3286990225315094, -0.5127040147781372, -0.401867151260376, -0.4869100749492645, -0.4068128168582916, -0.3157844841480255, 1.1509132385253906, -0.48055240511894226, 0.33992868661880493, 0.09389223903417587, -0.4256283640861511, 0.1096377745270729, -0.42742180824279785, -0.7441704273223877, -1.2033172845840454, -0.516338050365448, -0.4948049485683441, 0.2514209449291229, 0.5723338723182678, -0.041491903364658356, -0.436468243598938, -0.4769607186317444, 0.4385783076286316, -0.33454617857933044, 0.5833454728126526, -0.5486952662467957, 0.2281208485364914, -0.6129665374755859, 0.2884387969970703, -0.5757925510406494, -0.20517022907733917, -0.2957611083984375, -0.12524184584617615, 0.31104013323783875, -0.24162746965885162, -0.6751441955566406, -0.4121691584587097, -0.18777574598789215, -0.9710147380828857, -0.3349545896053314, -0.24855254590511322, -0.7226830124855042, -0.3371213972568512, -0.42850038409233093, -0.4637686610221863, 0.17169764637947083, -1.2708724737167358, -0.043162181973457336, -0.5925962328910828, -1.0736817121505737, -0.5104165077209473, 0.12402115017175674, -0.03352700173854828, -0.7628975510597229, -0.22313737869262695, -1.1150609254837036, -0.8123816847801208, -0.7336387634277344, -0.3313434422016144, -2.0239107608795166, -0.4651620090007782, -0.8782230019569397, -1.4051710367202759, -0.4337104260921478, -0.4259912669658661, -0.353391170501709, -1.3420288562774658, -0.2804759740829468, -1.0299748182296753, -0.442177414894104, -0.46883341670036316, -0.5557945966720581, -0.07874558866024017, -0.44664889574050903, -0.565666913986206, -0.08682340383529663, -1.4946919679641724, -0.5399129986763, 0.07438650727272034, -1.7329468727111816, -0.7571216225624084, 0.42451930046081543, -0.47165602445602417, -0.9435277581214905, 0.31989938020706177, -0.9691286683082581, -0.08059527724981308, -0.4121728539466858, -0.10850518941879272, -0.40174996852874756, -0.31672734022140503, -0.45431262254714966, -1.058075189590454, -0.6294659376144409, -0.3121699392795563, -0.8047857880592346, -0.9361724257469177, -0.37516316771507263, -0.1942729949951172, -1.9875081777572632, -0.7299255728721619, 0.06507374346256256, -0.7609725594520569, -0.4791211783885956, -1.2441678047180176, -1.2553503513336182, -0.03950084000825882, -0.1666083186864853, 0.1005956381559372, -0.22509829699993134, 0.3991154134273529, 0.034970853477716446, -0.22644636034965515, -0.39227670431137085, -0.8503246903419495, -0.3657788336277008, -0.8243317604064941, -0.1774938851594925, -0.7306987643241882, -1.5875682830810547, -0.38658109307289124, -0.7434374690055847, 0.45850488543510437, -0.44956761598587036, -0.1109766736626625, 0.3535357713699341, -1.407901406288147, -0.14285776019096375, -0.8932188749313354, -0.553469717502594, -0.4150412678718567, 0.014406434260308743, -0.14128521084785461, -0.04767496511340141, -1.20125412940979, -0.8278799653053284, -0.7711002230644226, -0.587155282497406, 0.11004612594842911, -0.4342500567436218, 0.1092858612537384, -0.8524112701416016, -0.3754153251647949, 0.15542946755886078, 0.05741429701447487, -0.8528106212615967, -0.3037797510623932, -0.07580849528312683, -0.060785312205553055, 0.18431225419044495, -1.0232561826705933, -0.9269738793373108, -0.812168538570404, -0.22053277492523193, -1.1861937046051025, -1.0641216039657593, -0.8914490938186646, -1.3230682611465454, -1.6803417205810547, 0.1693914383649826, -0.3863680064678192, -0.5606505870819092, 0.09420385211706161, -0.6551228761672974, -0.20636096596717834, -0.4447094202041626, 0.6067840456962585, 0.49004900455474854, -0.5634877681732178, 0.35954466462135315, -0.2585512399673462, 0.5613170266151428, 0.23844128847122192, -0.26247844099998474, 0.7394618391990662, -0.24647338688373566, 0.24205057322978973, 0.7864484786987305, 0.37644946575164795, 0.03831276670098305, -0.22946465015411377, -0.4486874043941498, -0.02027556113898754, 0.5931909680366516, -0.6524715423583984, -0.15039925277233124, 0.1156967282295227, -0.4864325523376465, -0.3336530029773712, -0.5944864153862, -0.6200605630874634, -0.3346468508243561, -0.13706263899803162, -0.6071227788925171, -0.7025513052940369, 0.4003273844718933, 0.7351430058479309, -0.5883057713508606, 0.04582936689257622, -0.5429326891899109, -0.37999024987220764, -0.6004964113235474, 0.6562301516532898, 0.3824732005596161, 0.7093963027000427, 0.6202447414398193, 0.11066348850727081, 0.7510902881622314, -0.5926644802093506, -0.07831103354692459, 0.355163037776947, 0.7519767880439758, -0.1697975993156433, -0.4946724772453308, 0.24168600142002106, -0.413025826215744, -0.25524410605430603, -0.7205935716629028, -0.6752123832702637, 0.24799269437789917, -0.6329279541969299, 0.2572154402732849, 0.5464274287223816, 0.42466747760772705, -0.4457593858242035, 0.4299570620059967, 0.48599451780319214, -0.7935598492622375, 0.6809351444244385, 0.1499670296907425, -0.5820316076278687, 0.5705277323722839, -0.6372337937355042, -0.7591625452041626, -0.09964455664157867, -0.4480067193508148, -0.23666606843471527, 0.5283677577972412, -0.2127184122800827, 0.2757169008255005, 0.1481635421514511, -0.5485171675682068, 0.655157208442688, -0.49093708395957947, 0.8183483481407166, -0.12078066915273666, 0.42619484663009644, 0.6806594133377075, -0.5025798678398132, -0.7123098969459534, 0.2968088686466217, -0.2719567120075226, 0.11205030977725983, -0.23237133026123047, -0.6623532772064209, 0.34812864661216736, -0.43443235754966736, 0.29446738958358765, 0.42357054352760315, -0.2687814235687256, 0.2929263114929199, -0.13621634244918823, 0.7921673059463501, 0.6123413443565369, -0.7556808590888977, -0.6762256622314453, -0.38400667905807495, -0.5930935144424438, -0.32313933968544006, -0.6008330583572388, -0.00727411825209856, 0.09502144157886505, 0.11547877639532089, 0.7497189044952393, 0.5570001006126404, 0.23444980382919312, -0.2718151807785034, 0.060458797961473465, -0.7200800180435181, -0.5716387629508972, 0.7279301881790161, -0.2295823097229004, 0.574001133441925, 0.5164781212806702, 0.6707369685173035, 0.5588528513908386, -0.6289219260215759, -0.13991470634937286, 0.5333795547485352, -0.6501206755638123, 0.3572748601436615, 0.6967166066169739, -0.6899882555007935, -0.22604414820671082, -0.1184774711728096, -0.27973172068595886, 0.16603028774261475, -1.0764838457107544, -0.20652371644973755, -0.1104687824845314, -1.1599996089935303, -0.1616891324520111, 0.5961030125617981, -0.18577104806900024, -1.0235726833343506, 1.215225100517273, -0.044249359518289566, -0.3517060875892639, -0.2584878206253052, -0.8596050143241882, -0.890070915222168, 0.11621361970901489, 0.6370220184326172, -0.7924987077713013, -0.6298421025276184, -0.7149979472160339, -0.35869571566581726, -0.11666308343410492, 0.44242599606513977, -0.5884842276573181, -0.49992242455482483, 0.4656507670879364, 0.27745556831359863, -0.026330305263400078, 0.3984757363796234, -0.0894942358136177, -0.7512519955635071, -0.0063117146492004395, -0.5806361436843872, 0.012763873673975468, 0.846019983291626, -1.0153874158859253, 0.4693777561187744, 0.9489133358001709, -0.05781562626361847, 0.623138427734375, -0.28818586468696594, -0.010360383428633213, -0.6358732581138611, 0.7889518737792969, -0.3358703851699829, -0.8234542608261108, -0.1146184653043747, -0.5368804335594177, 0.14313490688800812, 1.1061077117919922, 1.054336428642273, -1.256960391998291, 0.05953719839453697, -1.1388291120529175, 0.07832876592874527, -0.18331114947795868, -0.535086989402771, -0.49816378951072693, 0.03431045264005661, 0.6200399994850159, 0.34156534075737, -0.1988067328929901, -0.0858081579208374, -0.1261582374572754, -0.18132925033569336, 0.39387643337249756, -0.21912071108818054, -0.17500996589660645, -0.1597096472978592, -0.16565540432929993, -0.06477458775043488, -0.0340288020670414, -0.6790396571159363, 0.07581474632024765, 0.0916985422372818, 0.08095722645521164, 1.521133303642273, -0.9810312986373901, -0.8129778504371643, 0.17146962881088257, 0.03245425969362259, 0.9559789896011353, -0.0366872139275074, -0.15670673549175262, -0.0346217155456543, -0.32672664523124695, 0.4175197184085846, -0.5084747076034546, -0.41165727376937866, -0.6868870854377747, -0.28580015897750854, -0.1104828342795372, -0.5531582832336426, -0.4380428194999695, 1.1246803998947144, -0.040736470371484756, 0.527439534664154, 0.23054423928260803, -0.4790356159210205, 0.27570998668670654, -0.3124750256538391, -0.5126178860664368, -1.2459875345230103, -0.4897898733615875, -0.36353057622909546, 0.44653481245040894, 0.4315279722213745, -0.14593151211738586, 0.18586638569831848, -0.6444620490074158, 0.6464328169822693, -0.17338360846042633, 0.8106878995895386, -0.6373332142829895, 0.20484863221645355, -0.5645695328712463, 0.168697789311409, -0.3979526162147522, -0.6187333464622498, -0.17051725089550018, -0.19008633494377136, 0.34472575783729553, -0.16772006452083588]], [[0.062452368438243866, 0.1869191974401474, -0.8305533528327942, -0.8234015703201294, -0.19928136467933655, -0.5881733894348145, 0.2687608599662781, -0.6140389442443848, -0.6199933290481567, 0.2574257254600525, -0.18153919279575348, -0.6489095091819763, -0.4988158941268921, -0.2325008660554886, -0.10546290874481201, -0.05992419645190239, 0.14191900193691254, 0.12465934455394745, 0.44090935587882996, -0.2661670446395874, -0.9209273457527161, -0.45333635807037354, 0.03445076197385788, 0.2347206473350525, -0.7669584155082703, -0.05820167809724808, -0.9409101605415344, 0.2249525487422943, -0.4351038336753845, 0.4606328010559082, -0.14017358422279358, 0.18659308552742004, -1.6575748920440674, -0.904724657535553, -0.29925987124443054, -0.5114406943321228, -0.2447817623615265, -0.5346148610115051, -0.725479245185852, -0.040697310119867325, 0.24952299892902374, -0.4121415615081787, -0.6211070418357849, -0.2907083034515381, -0.29339468479156494, -0.5750067234039307, -0.439769446849823, -0.1632203310728073, -0.5485771298408508, 0.4355132579803467, 0.04621923714876175, -0.6939600706100464, 0.17627361416816711, -0.7151796221733093, -0.5721685886383057, 0.20593798160552979, 0.28646937012672424, -0.5390363931655884, 0.04193214327096939, 0.534699559211731, 0.19236059486865997, -0.10144785791635513, 0.718974769115448, 0.2598344683647156, -0.44316890835762024, -0.4202725887298584, 1.0581815242767334, -0.6299867033958435, -0.5157628655433655, -0.297682523727417, 0.16028384864330292, -0.20638839900493622, 1.3212859630584717, 0.31183502078056335, 1.1346510648727417, 0.4406060576438904, 0.25495168566703796, -0.2630451023578644, -0.7751681804656982, -0.3580237925052643, -0.04696022346615791, 0.3713226318359375, 0.12562036514282227, 0.052043814212083817, -0.22893591225147247, -0.18017950654029846, -0.2764609754085541, -0.20225375890731812, -0.5435927510261536, -0.7224863767623901, -0.03348902612924576, -0.7207242250442505, -0.15839985013008118, 0.3713899254798889, 0.2725076675415039, 0.16343460977077484, -0.30676424503326416, -0.5905987024307251, 0.7586198449134827, 0.20961126685142517, 0.41109901666641235, -0.08275735378265381, 0.22277572751045227, -0.12710008025169373, -0.1448892503976822, -0.03576766699552536, -0.053078994154930115, 0.4375481605529785, -0.2758682668209076, 0.018278047442436218, -0.43370670080184937, 0.7347627878189087, -1.1742299795150757, -0.4258289039134979, -0.27323272824287415, -0.37361443042755127, -0.38893404603004456, 0.405447393655777, -0.1887304037809372, -0.560524046421051, -0.06775691360235214, -1.0662835836410522, -0.6739959120750427, 0.1784980148077011, -0.02200869284570217, -0.5029461979866028, -0.30455467104911804, 0.034586526453495026, -0.3085451126098633, 0.5753462314605713, -0.4700864851474762, 0.8580859899520874, 0.2770053744316101, -0.6490771174430847, 0.2532130479812622, -0.32234686613082886, -0.318628191947937, 0.20744486153125763, 0.46567484736442566, -0.05292195826768875, -0.5717617869377136, -0.29111844301223755, -0.31242918968200684, 0.5742425918579102, 0.2453100085258484, -0.13283070921897888, 0.5479023456573486, -0.36470335721969604, 0.09448176622390747, -0.16191504895687103, 0.24573840200901031, -0.08440449088811874, 0.5784122347831726, 0.15303854644298553, -0.06034268066287041, 0.06972361356019974, -0.14908339083194733, -0.5263384580612183, -0.5845913887023926, 0.3175903856754303, 0.13934150338172913, 0.3858330249786377, 0.3679569363594055, -1.0060755014419556, -0.5301961302757263, -0.4006209969520569, 0.17761112749576569, -0.31322339177131653, 0.3291867673397064, 0.8422018885612488, -0.07368268072605133, -0.6179970502853394, 0.21104846894741058, -0.023945268243551254, -1.069831371307373, 0.4742189645767212, -0.08455291390419006, -0.33011043071746826, 0.06106441095471382, 0.2925122082233429, -0.2528333365917206, -0.34974512457847595, -0.28860002756118774, -0.05690169334411621, -0.06801129877567291, -0.5493002533912659, -0.3651895523071289, 0.2508409023284912, 0.5204908847808838, 0.3540523052215576, -0.1833164393901825, 0.35084661841392517, 0.15359985828399658, -0.7106932401657104, 1.0894808769226074, -0.7778606414794922, 1.2534624338150024, -0.24962687492370605, -0.11028840392827988, -1.2106112241744995, -0.4698687791824341, 0.4421713352203369, -0.12667523324489594, -0.17090632021427155, 0.45045557618141174, -0.2954488694667816, 0.2428794950246811, -0.10594013333320618, -0.3711925745010376, 0.3031676411628723, -0.04731132835149765, -0.0848698541522026, -0.2095361053943634, 0.5815224051475525, 0.01090281829237938, 0.08705314993858337, -0.7843640446662903, -0.15218669176101685, -0.7396573424339294, -0.07442069053649902, -0.10297631472349167, -0.10094150900840759, -0.24188126623630524, -0.5435846447944641, -0.5342257022857666, -0.12507261335849762, 0.05772702768445015, 0.033873286098241806, 0.5407081842422485, -0.2584415078163147, -0.9770261645317078, -0.10368660092353821, -0.767937183380127, -0.36941200494766235, -0.04437271133065224, 0.4113067388534546, 0.3842048645019531, -0.031241994351148605, -0.2110966593027115, -0.3081277906894684, -0.7269723415374756, 1.127469778060913, -0.09771276265382767, -0.5692439079284668, -0.09054261445999146, -0.17299216985702515, -0.4953899681568146, -0.7360933423042297, 0.347628116607666, -0.47126469016075134, 0.7458128333091736, -0.04711838811635971, -0.3153584599494934, -0.5274053812026978, -0.4766174554824829, 0.5438375473022461, -1.0173646211624146, 0.1711803376674652, 0.30245381593704224, 0.10001781582832336, -0.11993539333343506, 0.08961386978626251, -0.045258499681949615, 0.13931334018707275, 0.08762919902801514, 0.007655637338757515, 0.09038690477609634, 0.04575123265385628, 0.1884932965040207, -0.09706062823534012, 0.050970252603292465, -0.24896983802318573, 0.10469034314155579, 0.32399430871009827, 0.35696977376937866, 0.14099088311195374, 0.14173927903175354, 0.17921726405620575, 0.23283158242702484, 0.11871387809515, -0.05450183153152466, -0.11103808134794235, 0.21158014237880707, 0.2921752333641052, 0.06583278626203537, -0.07768739014863968, -0.07659202814102173, 0.18599213659763336, 0.31591567397117615, -0.015015246346592903, -0.07516057789325714, -0.11057669669389725, 0.2183636724948883, 0.13095661997795105, -0.01115212868899107, -0.12494473159313202, -0.25261256098747253, 0.1481064260005951, 0.13240694999694824, -0.24964193999767303, 0.02711380273103714, 0.1342727392911911, 0.5971885323524475, -0.06529401242733002, 0.001558832824230194, -0.029711151495575905, 0.15851876139640808, -0.027181681245565414, -0.10190252959728241, -0.4521464407444, -0.09927117824554443, 0.18603651225566864, -0.030707819387316704, 0.13451965153217316, 0.30447274446487427, -0.12353236973285675, -0.40612557530403137, -0.22741982340812683, -0.15219387412071228, 0.05067247524857521, -0.08861865848302841, 0.165151908993721, 0.3014349043369293, 0.21431197226047516, 0.27043551206588745, -0.09646283090114594, 0.08801824599504471, -0.43945926427841187, 0.02291189134120941, -0.23665188252925873, 0.09168022125959396, -0.17392145097255707, 0.0012512010289356112, 0.2337549477815628, -0.050316426903009415, -0.029803520068526268, 0.19276335835456848, -0.012992984615266323, 0.11974813789129257, 0.14810751378536224, 0.15390390157699585, 0.27611222863197327, -0.06207527965307236, -0.0826956182718277, 0.1565253883600235, -0.4013994336128235, -0.012504554353654385, -0.10174837708473206, -0.11568037420511246, -0.03952478989958763, -0.06273041665554047, -0.3797786831855774, 0.004310089163482189, -0.6274095177650452, -0.2921634316444397, 0.07802945375442505, -0.24326948821544647, 0.017462529242038727, 0.2682398855686188, 0.17027319967746735, 0.12194856256246567, 0.07777906954288483, 0.05595824122428894, 0.0672013908624649, -0.27012142539024353, 0.16271525621414185, 0.03266259655356407, -0.11772489547729492, 0.12882931530475616, -0.12965258955955505, -0.1438555270433426, 0.11360549926757812, -0.3315145671367645, -0.015137824229896069, 0.18559041619300842, -0.1268049031496048, -0.2726123332977295, -0.19676755368709564, 0.13992294669151306, -0.08184351772069931, -0.23400871455669403, 0.007203852292150259, -0.11007438600063324, -0.019254906103014946, -0.23571819067001343, 0.5724936127662659, -0.9168736934661865, -0.23019331693649292, -0.330163836479187, -0.7315323352813721, 0.13397125899791718, -1.1370112895965576, -0.6692308187484741, 0.9082720279693604, 0.5168610215187073, 0.24759875237941742, -0.06051056459546089, -0.3180601894855499, 0.29240792989730835, 0.35045909881591797, 0.09081192314624786, -0.12109114974737167, 0.8240959048271179, -0.040140215307474136, -0.6349712610244751, -0.041369348764419556, 0.15972581505775452, -0.021713128313422203, -0.23146666586399078, -0.057931363582611084, -0.27006247639656067, -0.22813594341278076, -0.30108100175857544, -0.6141045689582825, -0.37384262681007385, 0.307182639837265, -0.9638769030570984, -0.2195829451084137, -0.04519296810030937, -0.7846447229385376, -0.07728254050016403, -0.7410409450531006, -0.2257610261440277, -0.25439053773880005, 0.16187317669391632, 0.019448520615696907, -0.8168647289276123, -0.4903458058834076, -0.08853181451559067, -0.5192592740058899, -0.08802568167448044, 0.33002573251724243, -0.3167170286178589, -0.13638557493686676, 0.4323314130306244, 0.19136479496955872, -0.331277996301651, -0.5102735161781311, -0.564620316028595, 0.2408975213766098, 0.0928012803196907, -1.1440105438232422, -0.01387777179479599, -0.05725232511758804, 0.2788953483104706, 0.29290732741355896, 0.3627591133117676, 0.29029473662376404, -0.050078559666872025, -0.24065262079238892, 0.9752522110939026, -0.5915346741676331, 0.33237165212631226, -0.15570172667503357, 0.33453619480133057, -0.9061687588691711, 0.29530489444732666, 0.5792971253395081, 0.05840931832790375, -0.013635396957397461, -0.473764032125473, -0.08128063380718231, -0.48015233874320984, -0.6493070125579834, 0.18693287670612335, 0.5600341558456421, 0.2899782955646515, 0.19599983096122742, -0.026558009907603264, -0.12191800028085709, 0.35236093401908875, -0.19141806662082672, -0.4821056127548218, -0.6398653984069824, -0.6299071907997131, -0.32488590478897095, 0.20930694043636322, 0.12174608558416367, -0.06205839291214943, 0.14211700856685638, -0.2205459624528885, -0.2202567607164383, 0.720615565776825, -0.12212413549423218, 0.6901921629905701, 0.11954928934574127, -0.3761899471282959, -0.07657008618116379, -0.3112233579158783, -0.183823823928833, 0.022938380017876625, 0.3365795314311981, 0.4133963882923126, -0.2870461940765381, 0.3005315661430359, -0.1084699034690857, -0.24929240345954895, 0.42492541670799255, 0.22039161622524261, -0.49656400084495544, -0.4483068883419037, 0.7654070854187012, -0.012131301686167717, -0.7388296723365784, 0.3942156434059143, -0.9673232436180115, 0.00771556468680501, -0.23339778184890747, -0.8489386439323425, -0.8732108473777771, -0.4548574686050415, 0.25499334931373596], [0.25505614280700684, -0.4980688691139221, 0.20433734357357025, 0.12761373817920685, -1.7663370370864868, 0.29503318667411804, 0.21824169158935547, 0.03454389423131943, 0.48219916224479675, -0.14049015939235687, 0.49262920022010803, 1.7108430862426758, -0.5974950790405273, -0.6107401847839355, 1.1218401193618774, 0.14494885504245758, -0.4776463210582733, -0.8351682424545288, -0.41309282183647156, -0.29197677969932556, 1.0863622426986694, -0.2686583697795868, -0.5366852879524231, 0.7777776122093201, 0.0810391753911972, 0.07205859571695328, 0.3204808533191681, -0.075940802693367, 0.05491501837968826, -0.6015390157699585, 0.7944844365119934, 1.1278517246246338, -0.7068313360214233, 0.5797522068023682, 0.4777275025844574, -0.653447687625885, -0.7022194862365723, -1.0178673267364502, 0.03823314979672432, 1.0662257671356201, 0.3523181676864624, 2.13649845123291, -0.11922886222600937, -0.022498629987239838, -0.011134320870041847, 0.0854746475815773, -0.047602880746126175, -0.8053508400917053, 0.595454216003418, 0.2815339267253876, -0.5373921394348145, -0.5229887962341309, -0.38289204239845276, -0.4098552465438843, 0.9004913568496704, 0.749670147895813, 0.02566182240843773, 0.3822607100009918, -0.34457385540008545, -0.4708886742591858, -1.3382525444030762, -1.2146257162094116, -0.7397662997245789, -0.11992789804935455, 0.4897972643375397, 0.17124304175376892, -0.16094079613685608, 0.3948856294155121, 0.20361614227294922, 0.6716439723968506, 1.1535555124282837, -1.9149080514907837, 0.007452547550201416, -1.1653006076812744, -0.7592248320579529, 0.7707945108413696, 0.1093473732471466, 0.26419857144355774, 0.07038138806819916, -0.6830746531486511, 0.14479051530361176, 1.4141530990600586, -0.27934587001800537, -0.4091561436653137, 0.32063883543014526, -0.3729206919670105, 1.3611236810684204, 0.12662558257579803, -0.7654726505279541, -1.5872802734375, -0.36005598306655884, 1.1926507949829102, -0.1872226595878601, -0.4200369119644165, -0.4078669250011444, 0.641715407371521, 0.23359912633895874, -0.5234017968177795, 0.7308283448219299, 0.37251973152160645, 0.5211073160171509, 0.9235842823982239, -1.0478435754776, -0.8320134878158569, 1.5329444408416748, -0.7840430736541748, -0.9817895293235779, -1.0021780729293823, -0.11337403953075409, -1.072385549545288, 2.495281934738159, 0.3679908514022827, -1.0560678243637085, 0.027149511501193047, 0.3131486475467682, 0.7561706304550171, -0.5851849317550659, 0.5110270977020264, 0.13353899121284485, -0.37950268387794495, -1.2085093259811401, 0.2944202125072479, 0.7788656949996948, -0.34020334482192993, -0.9685930013656616, 0.5869768857955933, 0.5261892676353455, -0.8221213221549988, -0.26754310727119446, -0.8320822715759277, -0.2434525489807129, -0.3278343677520752, 0.025660440325737, 0.04111742228269577, 0.11542213708162308, 0.5512560606002808, -0.5758731365203857, 0.1875791847705841, -0.649725079536438, 0.46180105209350586, 0.0895269438624382, -0.5219587087631226, -0.006416447926312685, -0.8083729147911072, 0.07180719822645187, -0.4071483910083771, 0.2133011370897293, 0.11999746412038803, 0.7734863758087158, -0.17645472288131714, -0.1074679046869278, 0.38323497772216797, -0.4073874354362488, -1.065637230873108, 0.05882664769887924, -0.4871448278427124, -0.06881439685821533, -1.3113248348236084, -0.29401496052742004, 0.14329643547534943, 0.20011240243911743, 0.19988985359668732, 0.05783701688051224, 0.14615567028522491, -0.3542218804359436, 0.3267998695373535, -0.23024584352970123, -0.3020097017288208, 0.5986631512641907, -0.26853546500205994, 0.06013781204819679, -1.0039286613464355, 0.8151242733001709, -0.06563913077116013, 0.3355548083782196, 0.4829632639884949, 0.09782113879919052, -0.9952535033226013, -0.3971211314201355, -0.10923971980810165, -0.47342196106910706, -0.40035274624824524, 0.757142186164856, -0.9787797927856445, -0.4101284146308899, -0.15498287975788116, -0.3478597104549408, -0.04364551603794098, -0.2971176505088806, -0.16183827817440033, 0.21957480907440186, -0.33017292618751526, -0.30489814281463623, -0.4573993384838104, -0.14433519542217255, -0.40637102723121643, 0.33101120591163635, 0.22257700562477112, -0.31555232405662537, -0.2771640121936798, -0.02294894866645336, -1.1217693090438843, 0.5065796375274658, 0.593628466129303, -0.22201277315616608, 0.05672284588217735, 0.12547598779201508, -0.05005693808197975, -0.12966419756412506, 0.722580075263977, -0.22730344533920288, -1.3403114080429077, -0.08846504241228104, 0.474680632352829, 0.1875942498445511, 0.21013672649860382, -0.4057166576385498, 0.045229826122522354, 0.7200535535812378, 1.1216208934783936, 0.16927377879619598, -0.4520655572414398, -0.5795547962188721, 0.08717359602451324, -0.24786418676376343, -0.2862534523010254, 0.30179792642593384, 1.559537649154663, 0.05536983162164688, -1.0381816625595093, -0.921862006187439, 0.2745332717895508, 0.6212984323501587, 0.21369124948978424, -0.5496904850006104, 0.5292715430259705, -0.5071355104446411, -0.12640070915222168, -0.4815200865268707, 0.191604346036911, -1.399378776550293, 0.3631252646446228, -0.04196732118725777, 0.3406652808189392, -1.2376962900161743, 1.5041916370391846, 0.16335220634937286, -0.07578973472118378, -1.2707576751708984, -1.0522605180740356, 0.01973159797489643, 0.17784638702869415, -0.4789479076862335, 0.4524940848350525, -1.0454789400100708, 0.280693918466568, -0.11033907532691956, 0.1701258420944214, -0.07137376070022583, 0.03288136050105095, -0.17962568998336792, 0.09610720723867416, -0.01201928686350584, 0.13533172011375427, -0.27001696825027466, 0.06950028985738754, 0.15902385115623474, -0.00121699133887887, 0.2406439334154129, -0.2254115790128708, -0.13375207781791687, -0.2144911140203476, -0.29643505811691284, -0.06950077414512634, 0.10624322295188904, 0.14094772934913635, -0.18583939969539642, 0.05116396024823189, 0.020512351766228676, -0.2204936146736145, 0.22361032664775848, 0.1792433112859726, -0.11273682117462158, -0.013461822643876076, -0.02934122085571289, -0.38980424404144287, 0.1390686333179474, -0.01019988302141428, -0.10108651965856552, -0.06173596903681755, 0.007732289843261242, -0.04625817388296127, 0.08485937863588333, -0.01333456952124834, 0.28098201751708984, 0.05353619158267975, 0.3014107346534729, -0.012988151051104069, 0.013909010216593742, -0.17363852262496948, 0.0811488926410675, 0.3955574035644531, 0.042432934045791626, 0.4050639867782593, -0.13249975442886353, 0.20037513971328735, 0.05970016121864319, -0.34103065729141235, 0.1242499127984047, 0.30687037110328674, -0.004023038782179356, -0.1547735184431076, 0.19190387427806854, 0.29562580585479736, 0.6085084080696106, -0.31081685423851013, 0.46250396966934204, -0.09667980670928955, -0.3503131866455078, 0.2200770229101181, 0.04170675575733185, 0.06112523376941681, -0.28234267234802246, 0.14252981543540955, 0.16337569057941437, 0.0727231502532959, 0.02076645940542221, 0.013241076841950417, 0.041175153106451035, -0.261177659034729, -0.30651602149009705, 0.08187468349933624, 0.5121976733207703, -0.21630533039569855, 0.2868855893611908, 0.1007738783955574, 0.09119609743356705, 0.04194067046046257, 0.1593758463859558, -0.042587801814079285, -0.01726195216178894, -0.14155839383602142, 0.01689058728516102, 0.41031044721603394, 0.623978316783905, 0.2052803337574005, -0.2907477915287018, 0.15193459391593933, -0.02713269554078579, 0.3332545757293701, 0.09550896286964417, -0.09722757339477539, -0.2388419806957245, 0.1941297948360443, -0.010037138126790524, -0.06833186745643616, -0.07596578449010849, -0.024107271805405617, 0.02817126363515854, 0.048753902316093445, 0.26129868626594543, 0.10302118211984634, -0.3487420380115509, -0.3360655605792999, -0.3089272081851959, 0.41153502464294434, -0.0034159356728196144, 0.165523961186409, 0.09610020369291306, -0.270303338766098, -0.0908503383398056, 0.062072426080703735, 0.10682374984025955, 0.022274788469076157, -0.021890664473176003, -0.24345672130584717, 0.04759236425161362, -0.1518886834383011, -0.11699606478214264, 0.5984592437744141, -0.3809315860271454, 0.11104460060596466, -0.1905941218137741, 0.1688547134399414, 1.0703296661376953, -0.5519413948059082, -0.518566370010376, 0.17249202728271484, -0.9800992608070374, 0.33629611134529114, -0.10376377403736115, -0.32001352310180664, 0.4927905797958374, -0.8416163921356201, 0.606892466545105, 1.1880532503128052, -0.2745875120162964, -1.0390220880508423, 0.49792149662971497, -0.3401729166507721, -0.13278353214263916, -0.6220967173576355, -0.4707299768924713, 0.29297348856925964, 1.0350381135940552, -0.5763735771179199, -0.43258413672447205, -0.05409248545765877, -0.29971981048583984, -0.5768070220947266, 0.22659561038017273, -0.2769322395324707, 0.24636909365653992, -0.6107324361801147, 0.2363748699426651, 0.3783477246761322, -0.07969995588064194, 0.7128741145133972, 0.545071005821228, -1.4402886629104614, -0.5567827224731445, -0.8727809190750122, -0.2058696299791336, 0.24713799357414246, -0.3164064884185791, 1.00717031955719, -0.5514501929283142, -0.08268509060144424, -0.6585041284561157, 0.18815520405769348, 0.24745161831378937, 0.4377102255821228, 0.10352706909179688, -0.8048962354660034, -0.21551358699798584, -0.3740712106227875, -0.8210013508796692, -0.17002810537815094, 0.6983924508094788, -0.35593605041503906, -0.35694509744644165, -0.1250094324350357, -0.7433958053588867, -0.3713957667350769, -0.37480947375297546, -0.41041117906570435, -0.11929550021886826, 0.18659447133541107, 0.3509727120399475, -0.2722454369068146, -0.3692222237586975, -0.07502755522727966, -0.04214690998196602, 0.4086000323295593, 0.7102956771850586, -1.7036629915237427, -0.350364089012146, -1.4191765785217285, 0.4080367088317871, -0.08326786011457443, -0.010229756124317646, 0.25716105103492737, 0.19542501866817474, -1.0202620029449463, -0.11477924138307571, 1.3594305515289307, 0.15084460377693176, -0.9288079142570496, 0.5098753571510315, 0.2883397042751312, 0.5499228835105896, 0.2289133220911026, -0.6875476241111755, -0.8706772923469543, 0.3239406645298004, 1.055540680885315, -0.22014647722244263, 0.023909611627459526, -0.6684740781784058, 0.5464724898338318, 0.1899479627609253, 0.19804660975933075, 0.3177371919155121, 0.3878749907016754, 1.0682060718536377, 0.1595233678817749, -0.4712664783000946, -0.34718817472457886, 0.5425205230712891, -0.41048917174339294, -0.4254867732524872, -0.37308362126350403, -0.14001567661762238, -1.4255399703979492, 1.1541290283203125, 0.7178507447242737, 0.25719165802001953, 0.8027076721191406, -0.02861202321946621, 0.32238760590553284, -0.7184215784072876, 0.8926427364349365, -0.4421723186969757, -0.26588329672813416, -0.8912250995635986, 0.26047033071517944, -0.047664836049079895, 0.4243290424346924, -0.808404266834259, 0.48666849732398987, -0.42414218187332153, -0.3683461546897888], [0.22695983946323395, -0.1783156841993332, -0.7027326226234436, -0.3357505798339844, -0.35228201746940613, 0.34645357728004456, -0.44515737891197205, -0.763001024723053, 0.24112145602703094, 0.18860208988189697, 0.47277021408081055, -0.908220112323761, -0.6875918507575989, -0.25109291076660156, 0.11659490317106247, -0.9280893206596375, -0.40029188990592957, -0.5531485080718994, -0.4841701090335846, -0.34932756423950195, -0.5496900677680969, -0.1204778328537941, -0.1320723295211792, 0.5907040238380432, 0.0619858093559742, -0.4785766005516052, 0.5486125349998474, -0.7844061255455017, -0.43207740783691406, 0.2923625111579895, -0.5449076890945435, -1.1177301406860352, 0.14781798422336578, -0.7155036926269531, -0.1015574261546135, -0.035115521401166916, 0.8024235963821411, -0.057648587971925735, -0.6695380806922913, -0.25752362608909607, -0.5304914712905884, -1.4731448888778687, 0.27846935391426086, -0.5457274913787842, -0.4484142065048218, -0.40245452523231506, -0.7891013026237488, 0.13199248909950256, 0.4498978853225708, 0.320224791765213, -0.24608057737350464, 0.13045263290405273, 0.5946012735366821, -1.110678791999817, -0.5316551327705383, -1.023589015007019, -0.11103115230798721, -0.6849668622016907, 0.08427046239376068, -0.04559946060180664, -0.7555826306343079, -0.06627283990383148, -0.1503932774066925, -0.17387409508228302, -0.31638604402542114, -0.5423176288604736, -0.40650761127471924, -0.297912061214447, -0.9458261132240295, -0.5223739743232727, -0.4558127522468567, 0.039621006697416306, 0.3265814185142517, -0.38896551728248596, -0.07780800014734268, -0.25331518054008484, 0.8284852504730225, -0.20362819731235504, -1.795593500137329, -0.7019971609115601, -0.05609205365180969, -0.42128756642341614, -0.34725409746170044, 0.04553520306944847, -0.5515844821929932, -0.21246759593486786, -0.8495468497276306, -0.2298412024974823, -0.6840779185295105, 0.016525743529200554, -0.038332559168338776, -0.9871644973754883, -0.06706339865922928, -0.5529486536979675, -0.26088815927505493, -0.5058353543281555, 2.028651475906372, 1.0910303592681885, -0.09896928071975708, -0.5149651169776917, -0.11156494170427322, -0.533045768737793, 0.6683813333511353, 0.8719189167022705, 0.17192134261131287, -0.2428773045539856, 0.4746519923210144, 0.4928497076034546, -0.7458891272544861, -0.3817701041698456, -0.6357269883155823, 0.9561944603919983, -0.2196466326713562, -1.2393838167190552, 0.013524342328310013, 0.1277211308479309, -0.07509630173444748, -0.4540897309780121, 0.13089200854301453, -0.47537174820899963, 0.049899425357580185, -0.3753524124622345, -0.4068479835987091, 0.1675570011138916, 0.1671082228422165, -0.014222090132534504, -0.5189865231513977, -0.28661996126174927, -1.1223818063735962, 0.3002857565879822, 0.10481218248605728, 0.3959120213985443, -0.583990216255188, -0.11041458696126938, -0.07121492177248001, -0.3150077760219574, -0.1412610113620758, 0.8023186922073364, 0.2615314722061157, 0.5235046148300171, -0.6334205865859985, 0.26427730917930603, 0.17207764089107513, 0.2604002058506012, -0.7043701410293579, -0.5221863389015198, 0.026161136105656624, -0.5580015778541565, 0.19768626987934113, -0.8279959559440613, 0.37892141938209534, 0.9597212076187134, 0.06889692693948746, 0.011924349702894688, -0.853061854839325, -0.24475696682929993, -0.3886845111846924, -0.495917946100235, -0.14144478738307953, -0.219122514128685, -0.5538111329078674, -0.48427966237068176, 0.09968781471252441, 0.4723859131336212, -0.18410995602607727, -0.7075806260108948, 0.863839328289032, -0.2739989459514618, -0.01436544582247734, 0.3379753530025482, -0.5104908347129822, -0.7762155532836914, -0.21871085464954376, -0.19407382607460022, 0.15641742944717407, -0.13989976048469543, -0.528893768787384, 0.34462758898735046, -0.5914747714996338, 0.1663135290145874, 0.6487770080566406, -0.08630023151636124, -0.5300862789154053, 0.8743099570274353, -0.002075255149975419, 0.23575976490974426, 0.6625124216079712, 0.12250123918056488, -0.6065104007720947, 0.01225070096552372, -0.3181120455265045, -0.004528486169874668, 0.17155736684799194, -0.30777454376220703, 0.3799198865890503, 0.20923326909542084, 0.48827534914016724, 0.41460761427879333, 0.14383886754512787, -0.046189431101083755, 0.7245791554450989, -0.6088077425956726, -0.007604701444506645, -0.15435680747032166, 0.019672976806759834, -0.17107507586479187, 0.030119404196739197, -0.33500778675079346, -0.26529449224472046, -0.08875985443592072, -0.06405667215585709, 0.07021360099315643, 0.3527582883834839, 0.26371660828590393, 0.3134186565876007, -0.8705119490623474, -0.3647838532924652, -0.7531754374504089, -0.555316150188446, 0.7105803489685059, 0.1710546910762787, -0.16256552934646606, 0.14723433554172516, -0.5600529313087463, -0.3316633105278015, -1.1083639860153198, -0.39781129360198975, -0.37914350628852844, 0.5357978343963623, 0.4291631877422333, -0.09914261102676392, -0.8190259337425232, -0.3216415345668793, -0.5449238419532776, -0.9967882037162781, -0.8209601044654846, 0.08639902621507645, -0.34024545550346375, 0.4977892339229584, -0.39990290999412537, -0.3178791403770447, 0.6370311379432678, -0.06320378184318542, -0.25211217999458313, -0.842073380947113, -0.6100233793258667, -0.32629111409187317, -0.3645399510860443, -0.007658875547349453, -0.3111746609210968, 0.47632646560668945, 0.8224205374717712, -0.48171737790107727, -0.08143581449985504, 0.6691473126411438, -0.37417346239089966, -0.09956135600805283, -0.28523385524749756, -0.5228360891342163, -0.11674616485834122, 0.043501321226358414, -0.3990424871444702, -0.12275923788547516, 0.17953215539455414, 0.4517698884010315, 0.005512522999197245, 0.29105302691459656, 0.06180446594953537, -0.06424585729837418, -0.06172153726220131, -0.03771950304508209, 0.14053873717784882, 0.27437523007392883, 0.27716609835624695, -0.06591645628213882, 0.02449169009923935, -0.18172936141490936, 0.03938319534063339, 0.14281751215457916, 0.07121161371469498, -0.0022055520676076412, -0.1734628975391388, -0.14202365279197693, -0.0772479698061943, 0.304583877325058, 0.2992490231990814, -0.10380276292562485, 0.1181318387389183, 0.30024847388267517, 0.038562845438718796, -0.10524526983499527, 0.03974274545907974, 0.0495152547955513, 0.10760461539030075, -0.13372698426246643, -0.03057105280458927, 0.1397916078567505, 0.1205020621418953, 0.08298385888338089, 0.09206832945346832, -0.031235618516802788, -0.19144819676876068, -0.27776506543159485, 0.018710367381572723, -0.0729193463921547, -0.3838168978691101, 0.021834807470440865, -0.4363848567008972, -0.00041623934521339834, 0.013439314439892769, 0.005407779477536678, -0.04265991970896721, 0.1026541218161583, -0.06735420227050781, -0.24820874631404877, -0.34707990288734436, -0.18321754038333893, 0.47419679164886475, -0.20624540746212006, -0.14159920811653137, -0.018697472289204597, 0.02552267163991928, -0.14103208482265472, -0.03576130419969559, 0.2678682804107666, -0.05989566445350647, 0.07858367264270782, -0.26179757714271545, -0.26154109835624695, 0.0859871506690979, -0.21693509817123413, -0.164698526263237, -0.0900958850979805, -0.003785148961469531, 0.1314724087715149, 0.11725477129220963, 0.20930103957653046, 0.032759279012680054, -0.1866796910762787, -0.04620666801929474, 0.011599963530898094, -0.37474802136421204, 0.013107074424624443, -0.06969677656888962, -0.12306735664606094, 0.13361547887325287, 0.1632462590932846, -0.0023395856842398643, -0.03443174436688423, 0.28846004605293274, -0.032056692987680435, -0.06114470958709717, -0.8050016164779663, 0.10161273181438446, -0.4077317416667938, -0.028875762596726418, 0.07168711721897125, 0.03928818926215172, -0.2782406508922577, -0.2551227807998657, 0.00042461781413294375, 0.08609943091869354, 0.08668157458305359, 0.06078753620386124, -0.2754421532154083, -0.10370179265737534, 0.007910873740911484, 0.12133429199457169, -0.02463252656161785, -0.48398080468177795, 0.06638909876346588, -0.018158892169594765, -0.17408062517642975, 0.0261932872235775, 0.2853095531463623, 0.18902623653411865, 0.176190584897995, 0.1803218275308609, 0.1132219135761261, 0.037952546030282974, -0.19456566870212555, -0.01814427226781845, -0.08062613755464554, -0.21160897612571716, -0.2724694013595581, 0.06465126574039459, -0.2944031357765198, 0.030495714396238327, 0.1471600979566574, -0.07436405122280121, 0.213438481092453, -0.2947463393211365, 0.13008448481559753, 0.4599435329437256, -0.0702514499425888, -0.690889298915863, -0.18666309118270874, -0.3013257086277008, -0.6013308167457581, -0.5431696176528931, -0.02207479067146778, -0.19831734895706177, -0.22213302552700043, -0.061080168932676315, -0.487685889005661, -0.2989768385887146, 0.26601049304008484, 0.8282712697982788, 0.06777775287628174, -0.30601000785827637, -0.28674551844596863, -0.8342918157577515, -0.9149568676948547, 0.09090901166200638, -0.22005179524421692, -0.49528613686561584, -0.28420424461364746, -1.0252617597579956, -0.2490367442369461, 0.7912783622741699, 0.32104161381721497, -0.2378116250038147, -0.3460468649864197, -0.4720817804336548, 0.25239697098731995, -0.35239580273628235, 0.572874903678894, -0.3725488483905792, -0.32429593801498413, -0.06772039085626602, -0.29709088802337646, 0.5006975531578064, -0.023122435435652733, -0.030146243050694466, -0.3328455686569214, 0.1860814392566681, 0.6182575821876526, -0.9033755660057068, 0.3489089012145996, -0.5358157157897949, 0.29781031608581543, -0.36073780059814453, 0.08312421292066574, 0.09461589902639389, -0.7662186026573181, 0.01326826959848404, -0.25816798210144043, 0.23622208833694458, -0.554173469543457, -0.7935388684272766, -0.033559445291757584, -0.15245601534843445, -0.5078747272491455, 0.10772478580474854, -0.6351168155670166, 0.32457223534584045, -0.31455931067466736, -0.22587935626506805, 0.12622196972370148, 0.05986545607447624, -0.15058982372283936, 0.16975246369838715, -1.198343276977539, -0.7614503502845764, -0.20087750256061554, -0.5805656909942627, 0.0727832019329071, 0.3276166021823883, -0.10038657486438751, -0.5001078248023987, -0.45207715034484863, 0.06585397571325302, -0.5559900999069214, -0.09175087511539459, 0.0055701881647109985, 0.037235360592603683, 0.3212132155895233, -0.3613634407520294, 0.15004299581050873, -0.4011704623699188, -0.41622641682624817, 0.1256486028432846, 0.04992033913731575, -0.19230355322360992, 0.18075767159461975, -0.46240901947021484, 0.287866473197937, -0.42917123436927795, -0.040575411170721054, -0.002242280635982752, -0.06972014158964157, 0.0585172101855278, 0.09438567608594894, -0.3065308928489685, -0.7309255599975586, 0.0536440871655941, -0.2565709352493286, -0.37984296679496765, -0.06870204210281372, 0.07593465596437454, -0.3252214789390564, -0.17366355657577515, 0.2430650293827057, -0.9901952743530273, -0.0038565387949347496, -0.8357899188995361, -0.6687051653862, -0.009598078206181526, -0.3084336221218109, -0.24072779715061188, -0.09520641714334488, -0.0795709416270256], [0.09165538847446442, -0.9944595098495483, -0.5754584074020386, 0.7256889343261719, 0.6315702795982361, 0.13986699283123016, -0.6773552298545837, 0.005289525259286165, 0.5355609655380249, 0.12163539230823517, -0.5924243927001953, -0.9770026803016663, -0.2813989818096161, 0.5486583709716797, -0.2537449300289154, -0.48252925276756287, -0.8969437479972839, 0.3724311590194702, 1.2615259885787964, 0.33910807967185974, 0.32589393854141235, 0.35508230328559875, -0.5848070383071899, -0.5149603486061096, -0.07623130083084106, -0.213125541806221, 0.15394745767116547, 0.3265189528465271, -0.15632611513137817, 0.4425700008869171, -0.869878888130188, -0.4535302519798279, 1.2543879747390747, 0.24612344801425934, 0.42463231086730957, 0.3611536920070648, -0.12294730544090271, 0.7555108070373535, 0.30794188380241394, 0.0299550611525774, -0.33725306391716003, -0.09892614185810089, -0.2571887969970703, 0.3263699412345886, 0.00046981562627479434, 0.045988112688064575, -0.20331159234046936, -0.8412342071533203, -0.4383244812488556, 0.19360873103141785, 0.536100447177887, 0.40712109208106995, -0.033576395362615585, 0.933466374874115, -0.2515696585178375, 0.24595315754413605, -0.22602760791778564, 0.7310675382614136, -0.5326200723648071, 0.2983349561691284, -0.3546304702758789, -0.7816289067268372, -0.6974024176597595, -0.7411852478981018, -0.43093615770339966, -0.2671930193901062, -0.7624484896659851, 0.2304934859275818, 0.002374598290771246, -0.11242683231830597, -0.7323988080024719, -0.29688212275505066, -0.1157006099820137, 0.9438047409057617, 0.01869267039000988, -0.6797479391098022, -0.31341975927352905, -0.24369390308856964, 0.46790793538093567, 0.16917118430137634, 