{"architecture": {"module": "keras", "class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 24, 1], "dtype": "float32", "sparse": false, "name": "input_layer"}, "registered_name": null}, {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 1]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}, "registered_name": null}, {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "zero_output_for_mask": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 24, 128]}}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.3, "seed": null, "noise_shape": null}, "registered_name": null}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 6, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}}], "build_input_shape": [null, 24, 1]}, "registered_name": null, "build_config": {"input_shape": [null, 24, 1]}, "compile_config": {"loss": "sparse_categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false}}, "weights": [[[0.0577583909034729, -0.5109848380088806, -0.8172768950462341, 0.7696152329444885, 1.2416176795959473, 0.17811203002929688, -0.664566159248352, -0.4193878471851349, -0.5586885809898376, -0.5610435605049133, -0.36122575402259827, 0.1892177313566208, -0.5287125706672668, -0.008329319767653942, 0.2507581412792206, 0.19672468304634094, -0.7485141754150391, -0.6145724654197693, 1.0198824405670166, 0.05591006204485893, -0.6494206786155701, -0.136758953332901, -0.16304509341716766, -0.4630272090435028, 0.31197237968444824, -0.5974076986312866, -0.06720024347305298, 0.9297729134559631, 0.9894838929176331, 0.5961097478866577, -0.4952363073825836, -0.7247112989425659, 0.13090816140174866, -0.31515997648239136, 0.5069430470466614, -0.4896657466888428, -0.34940871596336365, 0.05193566903471947, -0.574474573135376, 0.484199583530426, -0.40263137221336365, -0.1890285760164261, -0.804093062877655, -0.0023967651650309563, -0.7449975609779358, 1.329661250114441, -0.6087040305137634, -0.14185795187950134, -0.5070359110832214, 0.03390289098024368, 0.23576457798480988, 0.1267763078212738, 0.7572236657142639, 0.12648150324821472, -0.608251690864563, 0.21869273483753204, -0.1362627148628235, -0.14839498698711395, -0.4007536470890045, -0.39665690064430237, -0.7802451848983765, -0.5001294612884521, 0.4571847915649414, -0.07542575150728226, 0.09398949146270752, 1.0777044296264648, 0.2533566653728485, -0.08577459305524826, -0.4557994306087494, -0.09770852327346802, -0.631713330745697, 0.5047109127044678, 0.027156878262758255, 0.1376865655183792, -0.32376453280448914, -0.35707852244377136, 0.0844922587275505, -0.16400933265686035, 0.12131097912788391, -0.4120720624923706, -0.8067904710769653, -0.6241488456726074, 0.38108476996421814, 0.7472371459007263, -0.1052548959851265, -0.8414454460144043, 0.5380591750144958, 1.0859739780426025, -1.3736580610275269, -0.578873872756958, 1.347760796546936, -0.13061736524105072, -0.1793963760137558, -0.5148388743400574, -0.41730043292045593, 0.6598867774009705, 1.026367425918579, 0.6819028854370117, 1.1478126049041748, -0.35011595487594604, -0.5004481673240662, 0.13785724341869354, 0.31972458958625793, -1.151607632637024, 0.6867018342018127, 0.6342887282371521, -0.3236473500728607, 0.007235321681946516, -0.19306793808937073, -0.08430904150009155, 0.4233165979385376, -0.5861767530441284, -0.29683029651641846, -0.030492201447486877, 0.20513875782489777, 0.49319279193878174, -0.6223635673522949, -0.5746199488639832, -0.08566378802061081, -0.598594069480896, -0.24310879409313202, -0.34027916193008423, 0.6374635100364685, 0.8258243799209595, 0.61106938123703, 0.10271143913269043, -0.224190354347229, 0.06457149237394333, -0.11091859638690948, -0.6204285025596619, -0.3798796534538269, -0.20092646777629852, 0.029777677729725838, -0.1753871589899063, -0.02323184907436371, -0.25074854493141174, -0.05780639126896858, -0.3084697127342224, 0.5160961151123047, 0.0791194960474968, -1.1901910305023193, 0.18739630281925201, 0.009726690128445625, 0.10640596598386765, 0.09009771794080734, -0.5855288505554199, -0.1307707577943802, 0.04677921533584595, -0.31608831882476807, 0.10450136661529541, 0.15888968110084534, 0.11681236326694489, 0.1081637591123581, -0.11138420552015305, 0.0424044132232666, -0.7635146379470825, -0.13037049770355225, -0.18503904342651367, -0.14427044987678528, -0.8003906011581421, 0.10768360644578934, 0.22028838098049164, -0.04897990822792053, 0.018021302297711372, 0.21829620003700256, 0.055146969854831696, -0.46584561467170715, -0.24902327358722687, 0.3937458097934723, -0.2747300863265991, -0.3222190737724304, -0.08075892180204391, -0.6974267363548279, -0.9032172560691833, -0.19076822698116302, 0.07250892370939255, -0.3570345938205719, 0.030965585261583328, 0.2126035988330841, -0.29321542382240295, -0.288618266582489, 0.09059260040521622, -0.3315885066986084, -0.1670326441526413, 0.16439487040042877, 0.08704616874456406, 0.2995606064796448, -0.17034120857715607, -0.5040172338485718, 0.07934712618589401, 0.029508065432310104, -0.19975025951862335, 0.030387980863451958, -0.07777794450521469, -0.003583104582503438, -0.12735943496227264, -0.04779687896370888, 0.09536128491163254, 0.11775203794240952, -0.18942666053771973, -0.0032574995420873165, 0.08800815790891647, 0.013876533135771751, -0.5032742023468018, 0.055297136306762695, 0.22642011940479279, -0.09744195640087128, -0.1221449226140976, -1.3342368602752686, -0.16317589581012726, -0.27275019884109497, -0.20023314654827118, -0.2663806676864624, -0.4586836099624634, -0.4233550429344177, -0.05783417075872421, -0.6872707605361938, -0.4005747139453888, -0.08102038502693176, 0.273551881313324, 0.33964383602142334, -0.2781003415584564, -0.05553148314356804, -0.41073986887931824, -0.4518871605396271, -0.11189749091863632, -0.3964412808418274, 0.1991923749446869, 0.06529689580202103, 0.09111204743385315, -0.06423468142747879, -1.1759870052337646, -0.3754691481590271, -0.3165726661682129, 0.04717165231704712, 0.23726195096969604, -0.6311141848564148, -0.05694257840514183, -0.14620709419250488, 0.07657483965158463, 0.5721830129623413, 0.16656559705734253, -0.01631874404847622, -0.07434364408254623, -0.8076791167259216, -0.3791787624359131, -0.37611281871795654, -0.119440458714962, 0.19419652223587036, 0.15729601681232452, -0.8314900398254395, -0.26152923703193665, -0.45231232047080994, -0.20650731027126312, 0.29000207781791687, -0.17396868765354156, -0.6001356244087219, -0.48626604676246643, -0.04199483245611191, 0.5839998722076416, 1.2360533475875854, 0.47152167558670044, -0.2598304748535156, -0.2172488421201706, 0.05771477147936821, -0.09027241170406342, 0.09007047861814499, 0.5264537334442139, -0.6997739672660828, 0.43665578961372375, -0.7914836406707764, -0.9057396054267883, 0.23370297253131866, -0.3564566969871521, 1.214311122894287, -0.4140773415565491, -0.3738286793231964, 0.4456740617752075, -0.048877909779548645, 0.11906615644693375, -0.41053998470306396, -0.05856189504265785, -0.5160267353057861, -1.2964001893997192, 1.2694703340530396, 1.0747950077056885, 0.4010816812515259, 0.3136058449745178, 0.6216527223587036, 0.19828678667545319, -0.9183321595191956, 0.46430283784866333, -0.21322889626026154, -0.8074101805686951, 0.20637017488479614, 1.218846321105957, 0.06149934232234955, 0.6092872619628906, -0.38731780648231506, -0.5555997490882874, 0.31451359391212463, 1.3378103971481323, -0.1527702808380127, 0.5190380215644836, 0.2613057792186737, 0.5691565275192261, -0.7269917726516724, -0.8599602580070496, 1.1062064170837402, -0.8711557388305664, -0.06624135375022888, -1.2354342937469482, 0.5164483785629272, 0.52942955493927, -0.24884043633937836, 0.03033060021698475, -0.06494898349046707, 0.07684145122766495, -0.8597767353057861, 0.41242995858192444, -0.7553597092628479, 1.3004822731018066, -0.8052012920379639, -0.5235762596130371, -0.03281327709555626, 0.42685943841934204, 0.5530627369880676, -1.277474284172058, 0.9352361559867859, -0.6642336249351501, -0.19664382934570312, 0.23315763473510742, -0.7386049628257751, -0.39520731568336487, 0.674455463886261, 0.06482966244220734, -0.9335086941719055, 0.1984892338514328, 1.0786758661270142, 1.1814277172088623, 0.8220888376235962, -0.11887304484844208, 1.3386921882629395, 1.1858562231063843, 0.15176379680633545, -0.2666090726852417, 1.2099097967147827, 0.35330989956855774, 0.17043021321296692, 0.05861993879079819, -0.12216956168413162, 1.1632661819458008, 1.321357250213623, -1.197786569595337, 1.3967269659042358, -0.32339465618133545, 0.17344243824481964, -0.7334595322608948, 1.037407636642456, 0.7861751914024353, 1.2609515190124512, -1.297706127166748, 0.5008584260940552, -0.5831556916236877, -0.9846039414405823, -0.5428242683410645, -1.0015400648117065, 0.14638502895832062, 0.07410532981157303, 0.49423298239707947, -1.0445905923843384, 1.0748270750045776, -0.5910332202911377, -0.39661768078804016, -0.2918338179588318, -0.1378997564315796, -0.3499313294887543, 0.06681971997022629, 1.270430088043213, -1.1444857120513916, 0.7817005515098572, -0.7675575017929077, 0.1695747971534729, 0.8155108094215393, 0.26551955938339233, -0.3208255469799042, -0.6376330852508545, 0.9090458154678345, 1.7660757303237915, 0.4553971290588379, -0.1958703249692917, -0.28154459595680237, -0.36632564663887024, -0.50161212682724, -0.10648396611213684, 0.15628951787948608, -0.48050299286842346, 0.06867791712284088, 0.26031970977783203, 0.5315021872520447, -0.5451669096946716, -0.46807894110679626, 1.1097322702407837, 0.09111101180315018, -0.16554662585258484, 0.10710588842630386, 0.4938318729400635, -0.5021854639053345, 0.14112746715545654, -0.3266659677028656, 0.1604025661945343, 1.0491399765014648, 1.2363282442092896, 0.821271538734436, -0.2896008789539337, -0.5013598203659058, 0.5797465443611145, -0.36160871386528015, 0.671514630317688, -0.5317711234092712, -0.02952674590051174, 0.6037596464157104, -0.6288667917251587, 0.7717026472091675, -0.41065168380737305, -0.2702041268348694, -0.48539549112319946, 0.1079084649682045, -0.648041307926178, 1.475346565246582, -0.8354411125183105, 0.16529859602451324, -0.8090376257896423, 0.4759197235107422, 0.34317532181739807, -0.053183019161224365, 0.8648874759674072, 0.5285688042640686, -0.7470470666885376, 0.6561733484268188, 0.5899580717086792, 0.4367769956588745, 0.14676259458065033, -0.463571697473526, -0.718039870262146, -0.40328845381736755, 0.4102446436882019, 0.06824133545160294, 0.12916435301303864, 1.670564889907837, 0.39035308361053467, 0.0666961744427681, -0.5405433773994446, 0.0398334376513958, 0.45351269841194153, 1.1973183155059814, 0.19414028525352478, 0.5169975161552429, -0.411077082157135, -0.42613860964775085, 0.4024654030799866, 0.23653198778629303, 0.3895830512046814, -0.2442164123058319, -0.9718623757362366, -0.37030526995658875, 0.707416832447052, 0.9501389265060425, -0.08769230544567108, -0.4919489920139313, 0.8441551923751831, 1.2928729057312012, -0.9477742314338684, -0.2672351598739624, 1.344747543334961, -0.022268207743763924, -0.1408088356256485, -0.3544582426548004, 0.018193116411566734, 0.9769326448440552, 1.235007882118225, 0.7699941992759705, 1.6896963119506836, -0.343860000371933, -0.39695414900779724, -0.10209119319915771, 0.42379558086395264, -0.8538492321968079, 0.8514904975891113, 1.0427826642990112, 0.15563006699085236, 0.0010326309129595757, -0.2139853835105896, -0.12757956981658936, 0.6579878926277161, -0.33102118968963623, -0.04668988287448883, 0.09528108686208725, 0.6605387330055237, 0.8147648572921753, -0.4227559268474579, -0.2579314112663269, 0.06968558579683304, -0.21700158715248108, 0.1245194748044014, -0.3237721920013428, 0.5695258378982544, 1.0443494319915771, 0.61244136095047, 0.054228994995355606, -0.01265411451458931, 0.39133164286613464]], [[-0.36488938331604004, 0.2667849361896515, -0.5022307634353638, 0.21507321298122406, -0.5643022656440735, 0.5535261034965515, -1.0973902940750122, -0.09966094046831131, 0.22052356600761414, 0.09386688470840454, 0.5089398622512817, 0.024405628442764282, 0.3050643503665924, 0.5187599658966064, -0.24257153272628784, -0.054863784462213516, -0.4599781036376953, 0.13286660611629486, -0.3097362816333771, 0.5414143800735474, 1.1560519933700562, 0.11823771148920059, -0.393440842628479, -0.40637457370758057, 0.16073380410671234, -0.03728533536195755, 0.2633609175682068, -0.6813819408416748, -0.43785175681114197, -0.05334073677659035, 0.6405379772186279, -0.03602452576160431, 0.07261670380830765, -0.2533992826938629, -0.056353501975536346, -0.2672666907310486, 0.27031052112579346, 0.3737931549549103, 0.1547105610370636, -0.3742389976978302, 0.4884139895439148, -0.7222578525543213, -0.46995115280151367, -0.26161515712738037, 0.31888821721076965, -0.6365469694137573, -0.1709570288658142, -0.20623868703842163, 0.09975523501634598, 0.18920312821865082, -0.7862371802330017, -0.278159499168396, -0.16690951585769653, 0.05925730988383293, -0.0775800570845604, -0.9280622601509094, 0.29154130816459656, -0.6548094153404236, -0.058473095297813416, -0.22326761484146118, 0.21602284908294678, 0.6216279864311218, -0.15311813354492188, 0.4471670985221863, -0.210969939827919, -0.39341095089912415, -0.19988611340522766, -0.28332728147506714, -0.013597079552710056, 0.0884026363492012, 0.050554271787405014, 0.06826350092887878, -0.47682055830955505, 0.12670350074768066, -0.2712959349155426, 0.46665841341018677, -0.4565914571285248, -0.13277915120124817, 0.14942799508571625, 0.009563435800373554, -0.14262761175632477, 0.0745609700679779, -0.3617265820503235, -0.5890454053878784, -0.2868131101131439, -0.1449899822473526, -0.9952515959739685, -0.40878644585609436, -0.059022076427936554, -0.10265178978443146, -0.3752179443836212, -0.17754432559013367, -0.4648464322090149, -0.18522867560386658, 0.7670353651046753, -0.15445710718631744, -0.25556743144989014, -0.12122312933206558, 0.33491212129592896, 0.0504557341337204, -0.22383716702461243, -0.9475361108779907, -0.6097882986068726, -0.2491064965724945, -0.3067833185195923, -0.7324631214141846, 0.13127616047859192, -0.8930601477622986, -0.981231153011322, -0.4274682104587555, -0.8535683155059814, -0.07392840832471848, 0.4619618058204651, 0.021994484588503838, -0.7690772414207458, -0.7358313202857971, 0.4757862389087677, 0.21181416511535645, 0.16607551276683807, -0.11778701841831207, 0.17515498399734497, -0.3650306463241577, -0.5303129553794861, -0.10198212414979935, -0.0573396272957325, -0.9703301787376404, 0.07598511129617691, 0.5338708162307739, -0.4881846010684967, 0.044538483023643494, 0.34197360277175903, 0.08049739897251129, 0.030018741264939308, 0.09607087075710297, -0.1208314597606659, 0.7580486536026001, 0.9626267552375793, -0.34412530064582825, -0.04822281375527382, 0.028912929818034172, 0.04115600138902664, -0.07597937434911728, 0.2750808894634247, -0.4774354100227356, 0.5644195675849915, 0.22326450049877167, 0.20504887402057648, -0.04294803738594055, 0.7961168885231018, -0.2831934094429016, 0.2645955979824066, -0.10352136939764023, -0.3189782500267029, 0.291136771440506, -0.2233477532863617, 0.23948951065540314, 0.024110369384288788, -0.07273197919130325, 0.6121549010276794, 0.2443217635154724, 0.02126849628984928, 0.0407647080719471, -0.40781399607658386, -0.8084996938705444, -0.3514608144760132, 0.37379375100135803, -0.09088283032178879, 0.18017129600048065, 0.739263653755188, 0.3914220929145813, 0.15345843136310577, 0.5320712924003601, 0.07756832987070084, 0.6912420988082886, 0.3907191753387451, -0.4740045964717865, 0.002448954153805971, -0.0049665700644254684, 0.34880560636520386, 0.47753262519836426, -0.1625586301088333, -0.3389841914176941, -0.16638202965259552, -0.057981763035058975, 0.13980922102928162, -0.1303112506866455, -0.524929940700531, 0.012586046010255814, -0.10632708668708801, -0.022661522030830383, -0.12568050622940063, 0.7277092933654785, -0.2754020392894745, 0.11051708459854126, 0.08484850078821182, 0.20521730184555054, -0.0827544704079628, 0.0005801641382277012, 0.11551259458065033, 0.2400222271680832, -0.12050552666187286, -0.3728618323802948, -0.1032077819108963, 0.20745572447776794, -0.5141562819480896, -0.08684613555669785, -0.9010999798774719, -0.20151247084140778, -0.13778865337371826, 0.37185484170913696, -0.09095396101474762, -0.24601133167743683, -0.0410507395863533, 0.07021421194076538, 0.6850184798240662, 0.07732202112674713, -0.35859033465385437, 0.291691392660141, 0.2258514165878296, -0.17279553413391113, -0.24389134347438812, 0.22104023396968842, -0.5073251128196716, 0.12431928515434265, 0.2837391495704651, -0.0911393091082573, 0.30533111095428467, -0.005792800337076187, -0.16192997992038727, -0.03535880148410797, 0.2374476045370102, 0.22260794043540955, 0.27847933769226074, -0.08317718654870987, 0.2163172960281372, -0.26422783732414246, 0.27429115772247314, -0.18530307710170746, -0.5041683316230774, 0.35407185554504395, 0.0799403116106987, -0.39413049817085266, -0.1916520893573761, -0.13277168571949005, 0.22070442140102386, 0.4256734251976013, 0.5703155398368835, -0.1478811651468277, -0.0736563503742218, -0.19160650670528412, 0.3603101670742035, -0.19108954071998596, -0.07924956828355789, 0.2623881697654724, -0.16930218040943146, -0.13435789942741394, -0.344622939825058, 0.3760018050670624, 0.0793507918715477, -0.050403907895088196, 0.00692838616669178, -0.23511718213558197, -0.10556492954492569, 0.15920959413051605, -0.04773629084229469, 0.3109305202960968, -0.17612196505069733, 0.5028077363967896, 0.5750173330307007, -0.08599293977022171, -0.114833302795887, -0.08648890256881714, -0.05257062986493111, -0.059504177421331406, -0.04973534494638443, 0.035894155502319336, -0.27932024002075195, -0.047043103724718094, 0.05972706153988838, 0.23838363587856293, -0.24126918613910675, 0.024648819118738174, -0.31600508093833923, -0.13032245635986328, 0.045349378138780594, -0.17005440592765808, -0.22340814769268036, -0.15395179390907288, 0.11858557164669037, 0.12613873183727264, -0.06363210082054138, 0.09706328064203262, -0.08757718652486801, 0.34785157442092896, -0.17967082560062408, 0.09669230133295059, -0.08124545216560364, -0.121279276907444, -0.11903560161590576, 0.3102670907974243, -0.20274865627288818, -0.0027212058193981647, -0.14847896993160248, -0.2940455973148346, 0.10297498106956482, 0.5266190767288208, -0.17897601425647736, -0.01748421974480152, 0.07671588659286499, 0.28498393297195435, -0.05415493622422218, 0.08505146205425262, 0.052197642624378204, -0.04288042336702347, 0.25521254539489746, -0.1348007470369339, 0.14112314581871033, -0.15378940105438232, 0.037133585661649704, 0.08029848337173462, -0.04822192341089249, -0.023368019610643387, 0.025325991213321686, -0.43704235553741455, -0.2724141478538513, 0.3127814531326294, -0.05714070796966553, 0.03794674202799797, 0.06374640017747879, 0.08822163194417953, 0.06658215075731277, -0.38507166504859924, 0.32734251022338867, -0.02357434667646885, 0.14197909832000732, 0.1229797750711441, 0.22732959687709808, -0.22460222244262695, 0.020667266100645065, -0.053293950855731964, 0.08407509326934814, 0.11014297604560852, 0.040033720433712006, 0.038311973214149475, 0.06854923069477081, -0.21511393785476685, 0.061064258217811584, -0.0998641848564148, 0.08385227620601654, 0.02122855931520462, -0.056050725281238556, 0.11570946127176285, 0.1561388075351715, -0.1614183634519577, 0.1145993322134018, 0.08331776410341263, 0.10650526732206345, -0.1569884866476059, 0.08776511996984482, 0.06832683086395264, -0.09523403644561768, -0.0264609232544899, 0.0542222335934639, -0.22423651814460754, -0.24843692779541016, -0.136405348777771, 0.039237163960933685, 0.06372714787721634, 0.2877468764781952, -0.005523140542209148, -0.0133933424949646, -0.15191461145877838, 0.34147149324417114, 0.09943775832653046, -0.16606296598911285, -0.3348819613456726, -0.24942471086978912, 0.08979683369398117, -0.009897331707179546, 0.21606360375881195, -0.5973635315895081, 0.03773585706949234, 0.1192585676908493, 0.4829048216342926, -0.630097508430481, 0.060425110161304474, -0.27501380443573, -0.6223145723342896, -0.21104395389556885, 0.11333508789539337, -1.0349613428115845, 0.45332878828048706, -0.6324180960655212, -0.03267958015203476, -0.4689360558986664, 0.029114054515957832, 0.039733052253723145, 0.21795974671840668, -0.07485654950141907, -0.32129427790641785, -0.4229510724544525, -0.16113704442977905, -0.3772299587726593, 0.35648444294929504, 0.6003038287162781, 0.08146487921476364, 0.25093892216682434, 0.15095804631710052, -0.11295406520366669, -0.04462131857872009, -0.05698348954319954, -0.5077527761459351, -0.9289146661758423, -0.1413213014602661, -0.22636236250400543, -0.4525342583656311, 0.12907035648822784, -0.3775271773338318, -0.2987710237503052, -0.1300894320011139, -0.027156520634889603, -0.7860345244407654, 0.1773323267698288, -0.4113099277019501, -0.08307323604822159, -0.30489224195480347, -0.7017466425895691, -0.18994149565696716, 0.011390128172934055, -0.2056267410516739, 0.03877321630716324, -0.49374568462371826, -0.0033496208488941193, -0.08157510310411453, -0.22019407153129578, 0.09171184152364731, -0.15008951723575592, -0.3644040524959564, -0.04439320042729378, -0.4101889729499817, -0.8232686519622803, -1.1389834880828857, 0.046153463423252106, -0.06077049672603607, -0.374750018119812, 0.08191287517547607, -0.14226551353931427, -0.632013201713562, -0.24551109969615936, -0.4458438754081726, -0.2611124813556671, -0.41114285588264465, 0.06412208825349808, 0.023983824998140335, -0.1510409265756607, -0.25424066185951233, -0.13160033524036407, 0.0006896604900248349, -0.37971261143684387, 0.35229960083961487, -0.3838333785533905, -0.401448518037796, -0.4869794547557831, -0.13692492246627808, 0.4134545922279358, 0.19798752665519714, -0.4295756220817566, -0.478631854057312, -0.5480141043663025, -0.2830555737018585, -1.0399062633514404, -0.6686944365501404, -0.3039553165435791, -0.3385094404220581, -0.43273669481277466, -0.6403753161430359, -0.3313620686531067, 0.18848848342895508, -0.07124572992324829, -0.6316527724266052, -0.5647752285003662, 0.007233313284814358, -0.20071357488632202, -0.10158771276473999, 0.04134484753012657, -0.18262602388858795, -0.9295195937156677, -0.5360255241394043, 0.08551491051912308, -1.0472345352172852, -0.5864593386650085, -0.43585190176963806, -0.6501429677009583, -0.4776049256324768, -0.6992512941360474, 0.3252829313278198, -0.08372717350721359, -0.24447676539421082, -0.6569305062294006, -0.38232511281967163, 0.20406530797481537, 0.4843493700027466, -0.25577646493911743, -0.15957511961460114, 0.04350156709551811, -0.8097606897354126, -0.0842125341296196, 0.11102938652038574, 0.007262399420142174, -1.3526084423065186, 0.049761880189180374, -0.5623486042022705], [0.9860528111457825, -0.22725525498390198, 0.3916637599468231, 0.285797119140625, -0.7409884333610535, -0.7023212313652039, -0.16806164383888245, 0.4955911934375763, 0.536663293838501, -0.003834597999230027, -0.037857536226511, 0.08092542737722397, 0.5909110307693481, 0.0004011619894299656, 0.3615037798881531, 0.43448156118392944, -0.3547663688659668, -0.09824451804161072, -0.1263130158185959, 0.322065144777298, 0.3919984996318817, 0.09426096826791763, 0.31172212958335876, 0.5122357606887817, 0.363110214471817, -0.11541464179754257, 0.23272208869457245, 0.6915902495384216, -0.013683423399925232, 0.915385365486145, 0.47949057817459106, -0.5444395542144775, 0.42486947774887085, -0.04543367028236389, 0.6753612160682678, 0.6008555889129639, -0.5733463764190674, 0.570088803768158, 0.12641990184783936, -0.017536869272589684, 0.14793482422828674, -0.2438412457704544, 0.6782825589179993, 0.6750221848487854, 0.24604763090610504, -0.8267806172370911, -0.2716890871524811, 0.34557148814201355, -0.5494971871376038, 0.1714295595884323, 0.5023012161254883, 0.9899595975875854, 0.7721676230430603, 0.3900752365589142, -0.3213863968849182, -0.49955546855926514, 0.41761213541030884, 0.39095810055732727, 0.8150725364685059, -0.00164386339019984, 0.3831046223640442, -0.24560131132602692, 0.7966333627700806, -0.3086327612400055, 0.9804287552833557, -0.42227473855018616, 0.8221591114997864, 0.2348565310239792, -0.4059789478778839, 0.7768732309341431, 0.6923472285270691, -0.08384335041046143, 0.5855932831764221, 0.6238526701927185, 0.8090511560440063, 0.28038260340690613, 1.0255504846572876, 0.009046293795108795, 1.1559927463531494, -0.364658385515213, 0.7099445462226868, 0.2583934962749481, 0.8294774889945984, -0.08507735282182693, 0.4549417793750763, -0.6270658373832703, 0.24768394231796265, -0.014540784992277622, -0.382263720035553, -0.41360777616500854, 0.1135639175772667, 0.10771090537309647, 0.25833410024642944, -0.220927432179451, 0.6339647173881531, -0.05718604102730751, -0.016271011903882027, 0.0534583143889904, -0.4467165172100067, 0.7356797456741333, -0.3760792911052704, 0.8015813827514648, 1.2897636890411377, 0.761633574962616, 0.22023074328899384, -0.026612134650349617, 0.4311867952346802, 0.12595053017139435, -1.1838016510009766, 0.19259357452392578, 0.17680774629116058, 0.08283970504999161, -0.1747952550649643, 0.8131793737411499, 0.0737384706735611, 0.3672408163547516, 0.6321913003921509, 0.5370990633964539, 0.4137568175792694, -0.5360190272331238, 0.7227486371994019, 0.4710283875465393, 0.06528245657682419, 0.4552537202835083, 0.1506311297416687, 0.26027315855026245, 0.09428660571575165, 1.4667860269546509, 0.13254736363887787, 0.26925909519195557, 0.26944586634635925, 0.08753044158220291, 0.8043718934059143, 0.4197620749473572, -0.20197691023349762, -0.09647314995527267, 0.7177109122276306, 0.1662759780883789, 0.20071889460086823, 0.3024253249168396, 0.8841866850852966, -0.05882410332560539, -0.23557503521442413, 0.5405372977256775, -0.3899919092655182, 0.39727023243904114, 0.9830114245414734, 0.4650554060935974, 0.17712098360061646, -0.5222680568695068, 0.2272437959909439, 0.20248468220233917, 0.2868863046169281, 0.11712174862623215, 0.232986181974411, 0.28914675116539, 0.546069860458374, 0.7104496359825134, -0.5149293541908264, 0.4499400854110718, 0.7312935590744019, -0.28868532180786133, 0.7329281568527222, -0.5739797949790955, -0.8554227352142334, -0.08626892417669296, 0.14461344480514526, 0.6986008286476135, -0.31996968388557434, -0.27378028631210327, 0.0640721470117569, -0.8635166883468628, 0.3774905204772949, 1.1697336435317993, -0.03536832705140114, 0.4011199474334717, 0.41910693049430847, -0.010461906902492046, 0.2950179874897003, 0.5239832401275635, 0.8840605020523071, 0.1507938802242279, -0.303108811378479, 0.043385136872529984, 0.1477183848619461, 0.019199011847376823, 0.4475959539413452, -0.015263606794178486, 0.3167724013328552, -0.23613610863685608, 0.3713780641555786, -0.005624254699796438, 1.1920491456985474, 0.711103618144989, 0.07744232565164566, -0.11837022006511688, 0.08225429803133011, 0.622376561164856, -0.05912277474999428, 0.7180942296981812, 0.515916645526886, 0.16759078204631805, 0.6488733887672424, 0.402942955493927, 0.47630390524864197, 0.35825079679489136, 0.5112785696983337, -0.21516424417495728, 0.031199384480714798, 0.44522878527641296, 0.6021127104759216, 0.881942868232727, 0.9344965219497681, -0.12406313419342041, 0.5751291513442993, 0.2650679647922516, 0.5600593686103821, -0.2811509370803833, 0.4365575611591339, -0.6607520580291748, -0.22383379936218262, -0.39907750487327576, -0.05423518642783165, 0.724149763584137, 0.824767529964447, 0.04088374227285385, 0.6104713082313538, 0.4252544641494751, -0.010194932110607624, -0.13782358169555664, -0.41848504543304443, -0.08766543865203857, 0.7828345894813538, 0.2854812443256378, 0.020386189222335815, 0.365177184343338, 0.39454156160354614, -0.3322432339191437, -0.18771353363990784, -0.15945333242416382, -0.5293582081794739, -0.27522751688957214, 0.026966720819473267, 0.21504908800125122, 0.7178546190261841, 0.4439447820186615, 0.2133551836013794, -0.535642147064209, 0.38236406445503235, -0.251479834318161, 0.7216147184371948, 0.4466610848903656, 0.7846242189407349, 0.2910178005695343, -0.10325291752815247, 0.6031622290611267, 0.16919277608394623, -1.0573272705078125, -0.21036657691001892, 0.24269433319568634, 0.06264737248420715, -0.09999515861272812, 0.18541403114795685, -0.048900213092565536, -0.3863803446292877, -0.12069975584745407, -0.08247019350528717, 0.2626163363456726, -0.010929476469755173, -0.1478002369403839, 0.07804383337497711, -0.3897130489349365, -0.05049781873822212, -0.49599117040634155, 0.19773124158382416, -0.24728809297084808, -0.30299773812294006, -0.1270880550146103, -0.09868165105581284, -0.2792840898036957, -0.2624943256378174, 0.04738715663552284, -0.5047467947006226, -0.03696513548493385, 0.03148704767227173, 0.015304416418075562, -0.11948410421609879, 0.23012590408325195, 0.06862557679414749, -0.23318864405155182, -0.2070593237876892, -0.1518721878528595, 0.3006645739078522, -0.21722324192523956, -0.01476606447249651, 0.05297933146357536, -0.04441184923052788, -0.1267651915550232, 0.01820969022810459, 0.09702225029468536, 0.02765800431370735, 0.05201822891831398, -0.10468705743551254, 0.19030559062957764, -0.10917666554450989, -0.029096463695168495, -0.07457782328128815, -0.03242038935422897, 0.08430173993110657, 0.09334278851747513, 0.07924722135066986, -0.05997731536626816, 0.23452235758304596, 0.08572123199701309, -0.4494071900844574, 0.01138938870280981, 0.06541938334703445, -0.11991709470748901, 0.0597895011305809, 0.5177051424980164, -0.4728243947029114, 0.007166520692408085, 0.03581078350543976, -0.07768391072750092, 0.007592261768877506, 0.29931095242500305, 0.10776121914386749, 0.016153819859027863, 0.14116741716861725, 0.3837079405784607, -0.4492153525352478, 0.3290371000766754, -0.06782478839159012, -0.5259119272232056, -0.0853976309299469, -0.5996645092964172, -0.058798737823963165, -0.4117658734321594, 0.09011226892471313, 0.23320046067237854, 0.211451455950737, 0.1331947296857834, 0.08276794105768204, -0.08010157942771912, 0.2203221619129181, -0.12616945803165436, -0.05917742848396301, 0.0983530655503273, -0.11297605186700821, 0.06766469031572342, -0.3447853624820709, -0.03532536327838898, -0.03318452090024948, -0.07670238614082336, -0.016267623752355576, 0.2581504285335541, 0.12604737281799316, -0.03540751710534096, -0.35412517189979553, -0.3357824683189392, -0.11880188435316086, 0.01275850273668766, -0.270639568567276, 0.09992450475692749, -0.2027292102575302, -0.15103356540203094, -0.2227836549282074, -0.07675191760063171, 0.10658136755228043, 0.19855090975761414, -0.21024419367313385, 0.06420881301164627, -0.1830189824104309, 0.035662710666656494, -0.32112815976142883, 0.14550869166851044, -0.2711978852748871, 0.38256144523620605, 0.0749317929148674, 0.16649873554706573, 0.11433828622102737, 0.0029217954725027084, 0.10284100472927094, 0.04150707274675369, 0.7684586048126221, -0.16182656586170197, 0.18855325877666473, -0.3645881414413452, 0.4517363905906677, -0.44206973910331726, -0.057866740971803665, -0.17234177887439728, -0.002911438001319766, 0.22328901290893555, -0.10254523158073425, 0.09194737672805786, 0.364090234041214, 0.5934846997261047, 0.7680662274360657, 0.9032665491104126, -0.06531282514333725, -0.5622360706329346, 0.6897611618041992, -0.12470608949661255, 0.7784305214881897, 0.3540878891944885, 0.4243617355823517, 0.040274523198604584, -0.5324995517730713, -0.11644704639911652, 0.22770318388938904, 0.7929508090019226, 0.7352627515792847, 1.4994767904281616, 0.2853102684020996, -0.3142469525337219, 0.6263027787208557, -0.009058753028512001, 1.163739800453186, -0.3471938669681549, -0.194673091173172, 0.37293246388435364, 0.4512670338153839, 0.46578848361968994, -0.4390419125556946, -0.33194032311439514, 0.22211626172065735, 0.0885562002658844, 0.132193922996521, 1.074867844581604, -0.07807780802249908, 0.8817911744117737, 0.15981116890907288, 0.20903749763965607, 1.1135754585266113, 0.9635505676269531, 0.6673378348350525, 0.4935727119445801, 0.08414912223815918, -0.03214915096759796, 0.43315842747688293, -0.7313477993011475, 0.5225492715835571, 0.08423221856355667, -0.08033902943134308, -0.6899631023406982, 0.9506051540374756, -0.36142492294311523, 1.5782184600830078, 0.2836809754371643, 0.9214920401573181, 0.7303518652915955, 0.09925950318574905, 0.9862973690032959, 0.6649311184883118, 0.8533393144607544, 0.9553492069244385, 0.6905372142791748, 0.8844853043556213, 0.4748976230621338, 1.090917706489563, 0.23570802807807922, 1.0420567989349365, -0.27594316005706787, 0.2482103705406189, -0.010462163016200066, 0.7938351035118103, 0.7861652970314026, 0.952303946018219, -0.9012779593467712, 0.8885959982872009, 0.4490635395050049, -0.03408939391374588, -0.9308797717094421, 0.7644842863082886, 0.10543327778577805, 0.031018467620015144, -0.6872502565383911, 0.4297524094581604, 1.0108875036239624, 0.29583740234375, 0.5669547319412231, -0.06863044202327728, 0.41560980677604675, -0.3025151491165161, 0.223733052611351, 1.1859440803527832, 0.32473450899124146, 1.0408064126968384, 0.502602756023407, 0.18744388222694397, 0.2237878441810608, -0.201577827334404, 0.166463702917099, -0.3109312653541565, -0.09339867532253265, -0.17655278742313385, 0.6085197925567627, -0.11858129501342773, 0.33372655510902405, 0.6769166588783264, -0.014557546004652977, -0.09516093879938126, -1.0882569551467896, 0.7073067426681519, -0.03918660059571266, 0.5793830156326294, 1.020555019378662, 0.5824841856956482, -0.3999164402484894, -0.05278012529015541, 1.0246866941452026], [0.4164860248565674, 0.5487170815467834, -0.27416834235191345, 0.3359178602695465, 0.29184722900390625, -1.7549383640289307, 0.6577200889587402, -0.4087335467338562, 0.308622807264328, 0.10760603100061417, -0.25291287899017334, -0.5876736044883728, 0.5168330073356628, 0.4647946059703827, 0.4587614834308624, 0.30478447675704956, 1.044334053993225, 1.0136375427246094, 0.19318580627441406, -0.2459881752729416, 0.05091795325279236, 0.1455000787973404, 0.8322760462760925, -0.031024392694234848, 0.6782733201980591, 0.39261895418167114, -1.0037338733673096, 1.0286463499069214, 0.8232346177101135, 0.026269476860761642, -0.18483564257621765, -0.4418284296989441, 0.9969069957733154, -0.0368763767182827, 0.749763011932373, 0.00340431765653193, -0.3643455505371094, -0.15301287174224854, 0.7666553258895874, 1.0436172485351562, -0.3421769142150879, 0.3215952217578888, 0.6518644094467163, -0.3012513220310211, 0.674138069152832, 0.4740389287471771, -0.17849382758140564, -0.38990503549575806, 0.15280678868293762, 0.289105087518692, 0.3841533362865448, 0.5214529037475586, -0.027347614988684654, -0.00750861456617713, 0.26801854372024536, 0.8507505059242249, -0.24790936708450317, 0.26073312759399414, 0.026833221316337585, -0.21530728042125702, -0.07210619747638702, 0.07946436107158661, 0.03191163390874863, 0.29778769612312317, -0.2847490608692169, 0.8222373723983765, 0.10993816703557968, 0.56133633852005, 0.1757613569498062, -0.2987528145313263, -0.2729997932910919, 0.48696961998939514, -0.3968001902103424, 0.11343814432621002, -0.27171045541763306, 0.38579055666923523, 0.03685929253697395, 0.13193735480308533, 0.6505709290504456, -0.8449007272720337, -0.631761908531189, -0.7571826577186584, -0.044800274074077606, 0.637690544128418, 0.5147355794906616, -0.25396260619163513, 0.8089357018470764, 0.1797047108411789, -0.19768324494361877, 0.0558159202337265, 1.184261441230774, 0.11412506550550461, 0.5588927268981934, -0.14601673185825348, -0.1657758355140686, 0.44606468081474304, 0.7664494514465332, 0.16071587800979614, 0.547204315662384, -0.32459452748298645, -0.4759604334831238, -0.32124894857406616, 0.14272953569889069, -0.10866019874811172, 0.8345515131950378, 0.8773736357688904, -0.4140184819698334, 0.17247101664543152, 0.3492453396320343, -0.23480470478534698, 0.26115548610687256, -0.2639821469783783, 0.4608480632305145, -0.49513185024261475, 0.49337586760520935, -0.07995007187128067, 0.6754653453826904, 0.17198745906352997, 0.5682658553123474, -0.7967250347137451, -0.49340519309043884, 0.7361268401145935, 0.4123379588127136, 0.7203276753425598, 0.3469032347202301, -0.0591353178024292, 0.22490355372428894, -0.05330940708518028, 0.39771878719329834, -0.175624281167984, -0.26921796798706055, 0.12301946431398392, -0.36977145075798035, 0.16473384201526642, -0.4825431704521179, -0.4772016704082489, -0.04660910367965698, 0.1881144493818283, 0.7247247695922852, -0.2894378900527954, -0.16158068180084229, 0.319673091173172, 0.18936079740524292, -0.42046496272087097, 1.7605534791946411, 0.6367544531822205, -0.5507988333702087, -0.11746516078710556, 0.5406720042228699, 0.2167992889881134, -0.016384705901145935, 0.26264289021492004, 0.4321211874485016, 0.19972454011440277, -0.20427928864955902, 0.2585698068141937, 0.26978927850723267, 0.38780394196510315, -0.19818225502967834, -0.8153760433197021, 0.05616137012839317, 0.2739846706390381, -0.13650070130825043, -0.9674418568611145, 0.28130412101745605, -0.7287395596504211, 0.23447303473949432, -0.21378211677074432, -0.2930336892604828, 0.25623050332069397, 0.18580181896686554, 0.06635016202926636, 0.13416802883148193, -0.36530014872550964, 0.1602770835161209, -0.04850136488676071, -0.08871935307979584, 0.5565747022628784, -0.20251406729221344, -0.0676657110452652, -0.6718018651008606, 0.05112170800566673, 0.4784623980522156, -0.5241521000862122, -0.19241060316562653, 0.19996239244937897, 0.22873525321483612, 0.2374766618013382, -0.052996717393398285, -0.578199028968811, 0.03488760441541672, -0.1746050864458084, -0.11099809408187866, -0.07632970809936523, -0.2489570677280426, 0.2999306619167328, 0.4698329269886017, -0.3734036684036255, 0.521917462348938, 0.5002232193946838, -0.20241965353488922, 0.4014585316181183, -0.18748480081558228, -0.558466911315918, -0.1946357786655426, 0.06291571259498596, -0.6795654296875, -0.30443644523620605, -0.25750717520713806, -0.4388110935688019, -0.004965418018400669, -0.6185573935508728, -0.37425512075424194, -0.8315784931182861, 0.01581408455967903, -0.16208377480506897, -0.7642109394073486, 0.08831994235515594, 0.5675647854804993, 0.6152873635292053, 0.11223874241113663, -0.03974832594394684, -0.4499809443950653, -0.2772599160671234, 0.32560744881629944, -0.358182817697525, 0.5278360247612, -0.21526390314102173, -0.09298081696033478, 0.3307386040687561, -0.27393826842308044, -0.1830415576696396, -0.07417391985654831, 0.5689178705215454, 0.3680022060871124, 0.15044644474983215, -0.10673315078020096, -0.20373937487602234, 0.09526772797107697, 0.37571343779563904, 0.4609375298023224, 0.23672227561473846, -0.6395969390869141, 0.591431736946106, 0.051513269543647766, 0.18265070021152496, -0.5547166466712952, -0.003618962364271283, -0.22482265532016754, 0.7613372802734375, -0.71036696434021, -0.5457340478897095, 0.2986172139644623, 0.31426429748535156, 0.711100161075592, -0.5231500864028931, -0.33449843525886536, 0.29463380575180054, 0.015187026001513004, 0.06590470671653748, -0.04357818141579628, -0.18803821504116058, 0.25586798787117004, 0.2443602979183197, 0.2905026972293854, 0.5319359302520752, 0.18096430599689484, -0.24429449439048767, 0.18078020215034485, 0.13835254311561584, 0.17277412116527557, -0.1479942947626114, 0.3808410167694092, 0.32870370149612427, 0.0042521958239376545, 0.10320526361465454, 0.026131685823202133, 0.4691571295261383, -0.4315004348754883, 0.09800794720649719, 0.057337626814842224, 0.23571930825710297, 0.14209789037704468, -0.06569237262010574, -0.03876596316695213, 0.14152942597866058, -0.263508141040802, 0.08156890422105789, 0.08396554738283157, 0.24892497062683105, 0.019929934293031693, -0.08721386641263962, -0.4756287634372711, 0.228915736079216, 0.2901516854763031, 0.0406513512134552, 0.4923948347568512, -0.10676365345716476, 0.46067285537719727, 0.15898430347442627, -0.10897117853164673, -0.13656844198703766, -0.17936968803405762, -0.007355267647653818, 0.036896321922540665, 0.14285124838352203, 0.04447222501039505, -0.07774218916893005, 0.03554615005850792, -0.1872090995311737, 0.008721629157662392, 0.08709496259689331, -0.35337555408477783, 0.18752342462539673, -9.346757724415511e-05, -0.3938743472099304, 0.1665864735841751, 0.04708715155720711, -0.2306857705116272, -0.24118468165397644, 0.05887085571885109, -0.12269620597362518, 0.2741468548774719, -0.032063841819763184, 0.24361325800418854, 0.14300572872161865, 0.0695628747344017, 0.053020935505628586, 0.0324716679751873, -0.07279995083808899, -0.18601945042610168, -0.12321840226650238, -0.07617990672588348, -0.26556655764579773, -0.25946229696273804, 0.2290710210800171, 0.3535856008529663, -0.15581431984901428, 0.08007010072469711, 0.03856363520026207, 0.05238740146160126, -0.1360747069120407, 0.02201102115213871, -0.0081197340041399, 0.43182486295700073, -0.07148087024688721, 0.04220161959528923, 0.451010137796402, 0.023766443133354187, -0.26355695724487305, 0.13935750722885132, 0.08558394759893417, -0.0363735556602478, 0.10866986215114594, -0.05247698724269867, -0.3285045921802521, 0.2206651121377945, -0.272381067276001, -0.18150967359542847, -0.2656199038028717, 0.13163581490516663, 0.04675303399562836, -0.007383537478744984, 0.005800043232738972, -0.16617827117443085, -0.0810181051492691, -0.3292555510997772, -0.01556844636797905, 0.4785618185997009, 0.3433383107185364, 0.14572885632514954, -0.11314317584037781, -0.08624124526977539, -0.4760070741176605, 0.013101616874337196, -0.05527084693312645, 0.035045526921749115, -0.314561128616333, -0.031693167984485626, -0.09989709407091141, -0.06754536181688309, -0.2723928987979889, -0.311063289642334, -0.10935531556606293, 0.10097594559192657, 0.3062724471092224, -0.3919322192668915, -0.14722232520580292, 0.32003775238990784, -0.687771201133728, 0.07730396836996078, -0.6532835364341736, -0.19105154275894165, -0.14867688715457916, 0.22192545235157013, 0.3379896283149719, 0.49758318066596985, -0.01315373182296753, 0.022082043811678886, -0.4437376856803894, 0.22651448845863342, 0.8328521251678467, -0.10668231546878815, -0.1412532478570938, 0.28314822912216187, -0.2094065397977829, 0.6380448937416077, 0.18131613731384277, 0.0006722346879541874, 0.24318231642246246, -0.0028816559351980686, 0.8949108719825745, 0.6432740092277527, 0.42825233936309814, -0.313510924577713, -0.6113069653511047, 0.33343976736068726, 0.6517541408538818, 0.2435828596353531, -0.19008517265319824, -0.20381540060043335, -0.08828076720237732, 0.7437063455581665, 0.543315589427948, -0.18290354311466217, -0.09439997375011444, -0.3331586718559265, -0.4743916988372803, 0.251798152923584, 0.5622351169586182, 0.03318557143211365, -0.30699047446250916, -0.31268537044525146, 0.35782569646835327, 0.42627596855163574, 0.15521225333213806, -0.333798348903656, -0.4894477427005768, 0.2603055536746979, 0.4796467423439026, 0.12158651649951935, -0.8253602981567383, -0.37037941813468933, 0.0798560157418251, 0.041496023535728455, -0.11027882993221283, 0.24434423446655273, 0.19242653250694275, -0.07967403531074524, 0.7507862448692322, -0.1222098171710968, 0.37481406331062317, 0.27144917845726013, -0.17820939421653748, 0.07240033894777298, 0.7183510661125183, -0.6662745475769043, 0.5794935822486877, -0.22683046758174896, 0.05666002258658409, -0.025224553421139717, -0.13061125576496124, 0.025844430550932884, -0.7754519581794739, -0.5218076705932617, -0.6815148591995239, -0.1994619071483612, 0.3246684968471527, -0.11462453752756119, -0.28233012557029724, 0.5270321369171143, 0.018891019746661186, -0.5397668480873108, -0.058786291629076004, 0.5526692271232605, -0.2561362087726593, 0.1609591394662857, 0.08063122630119324, -0.28006651997566223, 0.3771856427192688, 0.8159316778182983, -0.032988715916872025, 0.3896534740924835, 0.5493677258491516, -0.06279854476451874, 0.047052182257175446, 0.21577151119709015, -0.3665061891078949, 0.5858408212661743, 0.8514790534973145, -0.23779311776161194, 0.20952224731445312, 0.12620948255062103, -0.5292011499404907, 0.29056867957115173, 0.02090276964008808, -0.050046708434820175, -0.41546890139579773, 0.3132939040660858, -0.6284953355789185, 0.2721821963787079, 0.37321385741233826, -0.33621877431869507, -0.7343663573265076, -0.10401111096143723, 0.5204850435256958, -0.061158835887908936, 0.49621301889419556, 0.5508980751037598, 0.2681065797805786, 0.3256085515022278, -0.1493081897497177], [-0.5018448829650879, 0.2850501239299774, 1.2967619895935059, -0.9462903141975403, -0.7489785552024841, 0.07308962196111679, -0.7097657918930054, 0.026235317811369896, -0.6655697822570801, -0.34932586550712585, -0.15290987491607666, -0.9786717295646667, 0.003538885386660695, -0.1082143783569336, 0.1153244823217392, -0.43389514088630676, 0.6271868944168091, 0.6262115240097046, 0.545481264591217, 0.904069721698761, -0.7129725217819214, 0.27862802147865295, -2.4312117099761963, 0.27506059408187866, -0.7901089787483215, 0.6688908934593201, 0.5838019251823425, 0.6385166645050049, 0.19052660465240479, -0.06460212916135788, 0.3773369789123535, 0.41370153427124023, -0.7059438824653625, 0.32739415764808655, -0.4027286171913147, -0.4254542887210846, -0.7496998310089111, -0.6224599480628967, 0.3431835472583771, 0.6589036583900452, 0.3261478841304779, 0.032799240201711655, -1.1469980478286743, 0.1620934158563614, -0.5409611463546753, 0.07877218723297119, 0.47349509596824646, -0.5876473784446716, -0.7927613258361816, -0.37648922204971313, 0.6404784917831421, 0.13066120445728302, -0.4859467148780823, -0.9476649761199951, -0.7603722810745239, 0.8332797884941101, 0.13225200772285461, -0.9981120228767395, 0.7296240329742432, 0.5334898829460144, -0.807205080986023, -0.3775598108768463, -0.32573240995407104, 0.7477539777755737, 0.02949121594429016, -0.5357063412666321, 0.18551701307296753, -0.3367977738380432, 0.5898908376693726, -0.19615115225315094, 0.6104370951652527, 0.17640437185764313, -0.6418356895446777, 0.31014949083328247, 0.5907590985298157, 0.9285213947296143, 0.3307975232601166, 0.6299506425857544, 0.12933851778507233, -1.3936315774917603, 0.21722060441970825, -0.1797787845134735, -0.45321187376976013, -0.46835634112358093, -0.027055278420448303, -0.9731852412223816, 0.31103071570396423, -0.2169574648141861, 